# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-03
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================

from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.通用工具集 import *


class 手机锁屏画面(神笔绘图板):

    def __init__(self, 作品文件路径):
        宽, 高 = 屏幕分辨率.我的手机()
        super(手机锁屏画面, self).__init__(作品文件路径=作品文件路径, 宽=宽, 高=高, 视图区=f"0 0 {宽} {高}")
        self.字体 = 系统字体.微软雅黑  # "安卓字体"

    def 创建界面(self):
        宽, 高 = self.宽, self.高

        self.画矩形(x=0, y=0, 宽=self.宽, 高=self.高, 填充颜色=颜色.黑色, 描边宽度=0).重新生成Id()
        # 顶端状态栏区域
        self.画矩形(x=0, y=0, 宽=self.宽, 高=110, 填充颜色=颜色.黑色, 描边宽度=0).重新生成Id()

        屏幕图标集 = [
            # ("增加.svg", 977, 2263, 5),  # SVG图片,x,y,缩放
            # ("笑脸.svg", 868, 2263, 3.5),
            # ("语音.svg", 25, 2263, 3.5),
            ("蓝牙.svg", 785, 40, 1.5),
            ("信号.svg", 826, 40, 1.8),
            ("4g.svg", 873, 35, 1.8),
            ("5g.svg", 925, 35, 1.8),
            ("电池.svg", 976, 22, 3.6),
            ("眼睛.svg", 155, 30, 3.5),
            ("来电.svg", 224, 35, 0.15),
            ("相机.svg", self.宽 - 142, self.高 - 110, 3.2),
            ("手电筒.svg", 72, self.高 - 120, 3.2),
            ("运动鞋.svg", 467, 605, 0.1),
            ("锁.svg", 507, 127, 3),
            ("hd.svg", 121, 33, 1.8),
            ("hd.svg", 121, 58, 1.8),
        ]

        for SVG图片, x, y, 缩放 in 屏幕图标集:  #
            self.导入SVG为组(SVG图片=资源库目录(f"素材/聊天窗口/{SVG图片}"), x=x, y=y).缩放(缩放).重新生成Id()

        self.写字(x=self.宽 / 2, y=self.高 / 5.8, 文字="13:14", 字体大小=260, 字体=self.字体, 填充颜色=颜色.白色).重新生成Id()
        self.写字(x=self.宽 / 2, y=self.高 / 4.2, 文字=" 5月20日星期六 四月初二", 字体大小=45, 字体=self.字体, 填充颜色=颜色.白色).重新生成Id()
        self.写字(x=self.宽 / 2, y=self.高 / 3.75, 文字=f"{全角空格}{全角空格}52013", 字体大小=35, 字体=self.字体, 填充颜色=颜色.白色).重新生成Id()

        self.写字(x=75, y=48, 文字=f"中国电信", 字体大小=22, 字体=self.字体, 填充颜色=颜色.白色).重新生成Id()
        self.写字(x=75, y=74, 文字=f"中国移动", 字体大小=22, 字体=self.字体, 填充颜色=颜色.白色).重新生成Id()

    def 创作(self):
        self.显示图框()
        self.创建界面()
        # self.贴图(x=0, y=0, 图片文件=资源库目录("图片/手机壁纸效果.jpg")).透明度(0.5)


if __name__ == '__main__':
    神笔 = 手机锁屏画面(作品文件路径="手机锁屏画面.svg")
    神笔.完成()
    # https://svgtopng.com/zh/  SVG 转 PNG 滤镜支持
    # 神笔.生成PNG(生成方式=PNG生成方式.cairosvg, 缩放=3) # 不支持滤镜
