# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-03
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
import os

from 神笔码靓.码靓库.手机.手机水珠主题壁纸 import 手机水珠主题壁纸
from 神笔码靓.码靓库.手机.手机绘图板 import 手机绘图板
from 神笔码靓.神笔库 import 样式工具集
from 神笔码靓.神笔库.元素库 import 矩形元素
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *
from 神笔码靓.神笔库.通用工具集 import *


class 手机彩虹背景壁纸(手机绘图板):

    def __init__(self, 作品文件路径, 显示整机=否, 显示状态栏=是,
                 锁屏=是, 锁屏字体颜色=颜色.白色, 手机颜色="#163844"):
        self.屏幕宽, self.屏幕高 = 屏幕分辨率.我的手机()
        super(手机彩虹背景壁纸, self).__init__(作品文件路径=作品文件路径, 屏幕大小=(self.屏幕宽, self.屏幕高),
                                       显示整机=显示整机, 显示状态栏=显示状态栏, 锁屏=锁屏, 锁屏字体颜色=锁屏字体颜色, 手机颜色=手机颜色)

    def 线性彩虹矩形(self, 开始位置, 结束位置) -> 矩形元素:
        渐变色 = self.创建彩虹线性渐变色(开始位置=开始位置, 结束位置=结束位置,
                             关键点偏移=(0, 1.0), 关键点透明度=1, 彩虹七色=样式工具集.彩虹色2)
        return self.画矩形(x=0, y=0, 宽=self.宽, 高=self.高, 填充颜色=渐变色, 描边宽度=0)

    def 径向彩虹矩形(self, 渐变开始中心点, 渐变半径) -> 矩形元素:
        渐变色 = self.创建彩虹径向渐变色(渐变开始中心点=渐变开始中心点, 渐变半径=渐变半径,
                             关键点偏移=(0, 0.7, 0.9), 关键点透明度=1.0, 彩虹七色=样式工具集.彩虹色2)
        return self.画矩形(x=0, y=0, 宽=self.宽, 高=self.高, 填充颜色=渐变色, 描边宽度=0).透明度(0.9)

    def 创作(self):
        # self.线性彩虹矩形(开始位置=(0, 0), 结束位置=(self.宽, self.高))
        偏移X = (self.高 - self.宽) / 2
        self.线性彩虹矩形(开始位置=(self.宽 + 偏移X, self.高), 结束位置=(-偏移X, 0)).添加到列表(self.屏幕元素列表)
