# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-04
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.手机绘图板 import 手机绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.通用工具集 import *


class 手机单色背景壁纸(手机绘图板):

    def __init__(self, 作品文件路径, 背景颜色, 显示整机=否, 显示状态栏=是, 锁屏=是, 锁屏字体颜色=颜色.白色, 手机颜色="#163844"):
        self.屏幕宽, self.屏幕高 = 屏幕分辨率.我的手机()
        super(手机单色背景壁纸, self).__init__(作品文件路径=作品文件路径, 屏幕大小=(self.屏幕宽, self.屏幕高),
                                       显示整机=显示整机, 显示状态栏=显示状态栏, 锁屏=锁屏, 锁屏字体颜色=锁屏字体颜色, 手机颜色=手机颜色)

        self.背景颜色 = 背景颜色

    def 创作(self):
        深色背景色3 = 颜色.颜色变深(self.背景颜色, 加深程度=0.8)
        深色背景色2 = 颜色.颜色变深(self.背景颜色, 加深程度=0.3)
        深色背景色1 = 颜色.颜色变深(self.背景颜色, 加深程度=0.05)

        增加渐变中间点 = [
            {"偏移": "20%", "颜色": 深色背景色2, "透明度": 1.0},
            {"偏移": "40%", "颜色": 深色背景色1, "透明度": 1.0},
            {"偏移": "50%", "颜色": self.背景颜色, "透明度": 1.0},
            {"偏移": "60%", "颜色": 深色背景色1, "透明度": 1.0},
            {"偏移": "80%", "颜色": 深色背景色2, "透明度": 1.0}]

        渐变色 = self.创建线性渐变色(开始颜色=深色背景色3, 结束颜色=深色背景色3,
                           开始位置=(0, 0), 结束位置=(self.屏幕宽, 0),
                           开始透明度=1, 结束透明度=1, 增加渐变中间点=增加渐变中间点)
        矩形 = self.矩形背景(填充颜色=渐变色)


if __name__ == '__main__':
    壁纸 = 手机单色背景壁纸(作品文件路径="手机单色背景壁纸.svg", 背景颜色="#1069A1")  # "#1069A1"
    壁纸.完成()
    壁纸.生成PNG()
