# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-03
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.手机绘图板 import 手机绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.通用工具集 import *


class 手机几何图形壁纸(手机绘图板):

    def __init__(self, 作品文件路径, 显示整机=否, 显示状态栏=是, 锁屏=是, 锁屏字体颜色=颜色.白色, 手机颜色="#163844"):
        self.屏幕宽, self.屏幕高 = 屏幕分辨率.我的手机()
        super(手机几何图形壁纸, self).__init__(作品文件路径=作品文件路径, 屏幕大小=(self.屏幕宽, self.屏幕高),
                                       显示整机=显示整机, 显示状态栏=显示状态栏, 锁屏=锁屏,
                                       锁屏字体颜色=锁屏字体颜色, 手机颜色=手机颜色)

        # self.显示图框()
        # self.贴图(x=0, y=200, 图片文件=资源库目录(f"图片/手机壁纸/参考.jpg")).缩放(1.9)

    def 创建几何图形1(self):
        渐变色0 = self.创建线性渐变色(开始位置=(24, 2214), 结束位置=(622, 916), 开始颜色="#7D2FE5", 结束颜色="#C5A5EE")
        渐变色1 = self.创建线性渐变色(开始位置=(211, 1170), 结束位置=(870, 351), 开始颜色="#2BFAA8", 结束颜色="#00C3F9")
        渐变色2 = self.创建线性渐变色(开始位置=(1067, 1595), 结束位置=(1066, 1108), 开始颜色="#F1DE4D", 结束颜色="#F3BE24")
        渐变色3 = self.创建线性渐变色(开始位置=(933, 2038), 结束位置=(433, 1652), 开始颜色="#FB9620", 结束颜色="#FD3E61")

        图形0 = self.画矩形(x=0, y=0, 宽=self.屏幕宽, 高=self.屏幕高, 填充颜色=渐变色0, 描边宽度=0).添加到列表(self.屏幕元素列表)
        图形1 = self.画圆(x=self.屏幕宽 / 2, y=self.屏幕高 * (1 / 5), 半径=self.屏幕宽 / 1.3, 填充颜色=渐变色1, 描边宽度=0).透明度(1).添加到列表(
            self.屏幕元素列表)
        图形2 = self.画圆(x=self.屏幕宽, y=self.屏幕高 * (2 / 3), 半径=self.屏幕高 / 3.5, 填充颜色=渐变色2, 描边宽度=0).透明度(0.85).添加到列表(
            self.屏幕元素列表)
        图形3 = self.画圆(x=self.屏幕宽 * (2 / 3), y=self.屏幕高 * (9 / 10), 半径=self.屏幕宽 / 2, 填充颜色=渐变色3, 描边宽度=0).透明度(0.8).添加到列表(
            self.屏幕元素列表)

        for 图形元素 in [图形0, 图形1, 图形2, 图形3]:
            模板 = self.创建模板(元素列表=[图形元素])
            模板.创造元素().阴影(偏移=(0, 2), 模糊度=10).添加到列表(self.屏幕元素列表)

    def 创建几何图形2(self):
        带宽 = self.屏幕宽 / 14
        模糊度 = 2
        阴影高度 = 2
        # 紫色
        紫色背景 = self.画圆(x=self.屏幕宽 / 2, y=self.屏幕高 / 2, 半径=self.屏幕高, 填充颜色="#C200D2").添加到列表(self.屏幕元素列表)
        # 最低蓝
        最低蓝矩形 = self.画矩形(x=0, y=self.屏幕高 / 2 + 带宽 * 1.5, 宽=self.屏幕宽, 高=带宽 * 2,
                         填充颜色="#7615E0", 描边宽度=0).阴影(偏移=(0, 阴影高度), 模糊度=模糊度).添加到列表(self.屏幕元素列表)
        # 下粉色
        下粉色矩形 = self.画矩形(x=0, y=self.屏幕高 / 2 + 带宽 * 5, 宽=self.屏幕宽, 高=带宽,
                         填充颜色="#F01A93", 描边宽度=0).阴影(偏移=(0, -阴影高度), 模糊度=模糊度).添加到列表(self.屏幕元素列表)
        # 右青色
        右青色矩形 = self.画矩形(x=带宽 * 7, y=self.屏幕高 / 3, 宽=带宽, 高=self.屏幕高 / 2 + 带宽 * 1.5,
                         填充颜色="#27CFF4", 描边宽度=0).阴影(偏移=(0, 阴影高度), 模糊度=模糊度).添加到列表(self.屏幕元素列表)
        # 上粉色
        上粉色矩形 = self.画矩形(x=0, y=self.屏幕高 / 2 + 带宽, 宽=self.屏幕宽, 高=带宽,
                         填充颜色="#EE1588", 描边宽度=0).阴影(偏移=(0, 阴影高度), 模糊度=模糊度).添加到列表(self.屏幕元素列表)
        # 黄色
        黄色矩形 = self.画矩形(x=0, y=self.屏幕高 / 2 + 带宽 * 3, 宽=self.屏幕宽, 高=带宽,
                        填充颜色="#FFD101", 描边宽度=0).阴影(偏移=(0, 阴影高度), 模糊度=模糊度).添加到列表(self.屏幕元素列表)
        # 左蓝色
        左蓝色矩形 = self.画矩形(x=带宽 * 4, y=self.屏幕高 / 3, 宽=带宽, 高=self.屏幕高 / 2 + 带宽 * 1.5,
                         填充颜色="#3D45E5", 描边宽度=0).阴影(偏移=(0, 阴影高度), 模糊度=模糊度).添加到列表(self.屏幕元素列表)

        模板 = self.创建模板(元素列表=[紫色背景, 最低蓝矩形, 上粉色矩形, 下粉色矩形, 右青色矩形, 黄色矩形, 左蓝色矩形])
        模板.创造元素().旋转(45, (self.屏幕宽 / 2, self.屏幕高 / 2)).缩放(6).平移(-self.屏幕宽 / 2.5, -self.屏幕高 / 1.9).添加到列表(self.屏幕元素列表)

    def 创作(self):
        pass
        # self.创建几何图形1()
        # self.创建几何图形2()
        # self.创建几何图形3()

# if __name__ == '__main__':
#     神笔 = 手机几何图形壁纸(作品文件路径="手机几何图形壁纸.svg")
#     神笔.完成()
#     # https://svgtopng.com/zh/  SVG 转 PNG 滤镜支持
#     # 神笔.生成PNG(生成方式=PNG生成方式.cairosvg, 缩放=3) # 不支持滤镜
