# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-04
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.手机绘图板 import 手机绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.通用工具集 import *


class 手机动漫主题壁纸(手机绘图板):

    def __init__(self, 作品文件路径, 显示整机=否, 显示状态栏=是, 锁屏=是,锁屏字体颜色=颜色.白色, 手机颜色="#163844"):
        self.屏幕宽, self.屏幕高 = 屏幕分辨率.我的手机()
        super(手机动漫主题壁纸, self).__init__(作品文件路径=作品文件路径, 屏幕大小=(self.屏幕宽, self.屏幕高),
                                       显示整机=显示整机, 显示状态栏=显示状态栏, 锁屏=锁屏,锁屏字体颜色=锁屏字体颜色,手机颜色=手机颜色)

        # self.显示图框()
        # self.设置背景色("#06A1D7")

    def 手机背景(self):
        渐变色0 = self.创建线性渐变色(开始位置=(0, 0), 结束位置=(0, self.屏幕高), 开始颜色="#1D349D", 结束颜色="#06A1D7")
        self.画矩形(x=0, y=0, 宽=self.屏幕宽, 高=self.屏幕高, 填充颜色=渐变色0, 描边宽度=0).添加到列表(self.屏幕元素列表)

    def 创作(self):
        self.手机背景()
        超级玛丽模板 = self.神笔模板("超级玛丽", 显示帽子=是)
        # 超级玛丽模板 = 神笔["超级玛丽"]
        超级玛丽 = 超级玛丽模板.创造元素(x=-100, y=self.屏幕高 / 3.1, id_="超级玛丽").缩放(1.6).添加到列表(self.屏幕元素列表)
        self.写软件信息(x=self.屏幕宽 / 1.40, y=self.屏幕高 / 1.15,
                   字体大小=50, 填充颜色="#FF0000", 是否转路径=是).添加到列表(self.屏幕元素列表)

# if __name__ == '__main__':
#     神笔 = 手机动漫主题壁纸(作品文件路径="手机动漫主题壁纸.svg")
#     神笔.完成()
#     # https://svgtopng.com/zh/  SVG 转 PNG 滤镜支持
#     神笔.生成PNG(生成方式=PNG生成方式.cairosvg, 缩放=3)  # 不支持滤镜
