# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-04
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.手机绘图板 import 手机绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.通用工具集 import *


class 手机姓氏主题壁纸(手机绘图板):
    def __init__(self, 作品文件路径, 姓氏, 显示整机=否, 显示状态栏=是, 锁屏=是,锁屏字体颜色=颜色.白色, 手机颜色="#163844"):
        self.屏幕宽, self.屏幕高 = 屏幕分辨率.我的手机()
        super(手机姓氏主题壁纸, self).__init__(作品文件路径=作品文件路径, 屏幕大小=(self.屏幕宽, self.屏幕高),
                                       显示整机=显示整机, 显示状态栏=显示状态栏, 锁屏=锁屏,锁屏字体颜色=锁屏字体颜色,手机颜色=手机颜色)

        # self.显示图框()
        self.姓氏 = 姓氏
        渐变色 = self.创建线性渐变色(开始位置=(0, 0), 结束位置=(0, self.屏幕高),
                           开始透明度=1, 结束透明度=1,
                           开始颜色=颜色.黑色, 结束颜色="#333333", 增加渐变中间点=[])

        self.画矩形(x=0, y=0, 宽=self.屏幕宽, 高=self.屏幕高, 填充颜色=渐变色).添加到列表(self.屏幕元素列表)

    def 满天星(self):
        for i in 范围(200):
            x = random.randint(50 * 10, self.屏幕宽 * 10 - 50 * 10) / 10.0
            y = random.randint(500, self.屏幕高 * 10 - 500) / 10.0
            大小 = random.randint(50, 200) / 10.0
            self.画四角星(x=x, y=y, 半径大小=大小 + 6, 内角点占比=0.15, 填充颜色=颜色.白色, 描边宽度=0).模糊(5).添加到列表(self.屏幕元素列表)
            self.画四角星(x=x, y=y, 半径大小=大小, 内角点占比=0.15, 填充颜色=颜色.白色, 描边宽度=0).透明度(0.8).添加到列表(self.屏幕元素列表)

    def 修改文件名(self, 原始文件名: str):
        return 原始文件名.replace("{姓氏}", self.姓氏)

    def 创作(self):
        字体大小 = 500
        下移Y = 100
        self.满天星()
        # self.画六角星(x=self.屏幕宽 / 2, y=self.屏幕高 / 2, 半径大小=字体大小 / 1.2,内角点占比=0.8)
        self.画圆(x=self.屏幕宽 / 2, y=self.屏幕高 / 2 + 下移Y, 半径=字体大小 / 1.6, 描边颜色=颜色.白色, 描边宽度=6).模糊(5).添加到列表(self.屏幕元素列表)
        self.画圆(x=self.屏幕宽 / 2, y=self.屏幕高 / 2 + 下移Y, 半径=字体大小 / 1.6, 描边颜色=颜色.白色, 描边宽度=6).添加到列表(self.屏幕元素列表)

        self.画圆(x=self.屏幕宽 / 2, y=self.屏幕高 / 2 + 下移Y, 半径=字体大小 / 1.4, 描边颜色=颜色.白色, 描边宽度=6).模糊(5).添加到列表(self.屏幕元素列表)
        self.画圆(x=self.屏幕宽 / 2, y=self.屏幕高 / 2 + 下移Y, 半径=字体大小 / 1.4, 描边颜色=颜色.白色, 描边宽度=6).添加到列表(self.屏幕元素列表)

        self.文字转路径(x=self.屏幕宽 / 2 - 字体大小 / 2, y=self.屏幕高 / 2 - 字体大小 / 1.5 + 下移Y, 文字=self.姓氏, 字体大小=字体大小 * 1.01,
                   字体文件=字体文件目录("小篆体.ttf"), 填充颜色=颜色.白色, 描边宽度=0).模糊(10).添加到列表(self.屏幕元素列表)
        self.文字转路径(x=self.屏幕宽 / 2 - 字体大小 / 2, y=self.屏幕高 / 2 - 字体大小 / 1.5 + 下移Y, 文字=self.姓氏, 字体大小=字体大小,
                   字体文件=字体文件目录("小篆体.ttf"), 填充颜色=颜色.白色, 描边宽度=0).添加到列表(self.屏幕元素列表)

        self.写软件信息(x=self.屏幕宽 / 1.40, y=self.屏幕高 / 1.15, 字体大小=50, 填充颜色="#ffffff", 是否转路径=是).模糊(3).添加到列表(self.屏幕元素列表)
        self.写软件信息(x=self.屏幕宽 / 1.40, y=self.屏幕高 / 1.15, 字体大小=50, 填充颜色="#ffffff", 是否转路径=是).添加到列表(self.屏幕元素列表)

# if __name__ == '__main__':
#     神笔 = 手机姓氏主题壁纸(作品文件路径="姓氏{姓氏}主题壁纸.svg", 姓氏="魏")
#     神笔.完成()
#     # https://svgtopng.com/zh/  SVG 转 PNG 滤镜支持
#     # 神笔.生成PNG(生成方式=PNG生成方式.cairosvg, 缩放=3) # 不支持滤镜
