# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-07
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库.元素库 import 元素模板
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *
from 神笔码靓.神笔库 import 神笔模板
from 神笔码靓.神笔库.定义集 import *


class 智能手机神笔模板(神笔模板):
    def 模板ID(self):
        return "智能手机"

    def 元素列表(self):
        绘图板 = self.绘图板

        屏幕大小 = self.获取参数("屏幕大小", None)
        if 屏幕大小 is None:
            屏幕宽, 屏幕高 = 屏幕分辨率.我的手机()
        else:
            屏幕宽, 屏幕高 = 屏幕大小

        左右边距 = self.获取参数("左右边距", 50)
        上边距 = self.获取参数("上边距", 180)
        下边距 = self.获取参数("下边距", 80)
        描边宽度 = self.获取参数("描边宽度", 1)
        手机颜色 = self.获取参数("手机颜色", "#163844")

        手机外壳模板 = 绘图板.神笔模板("手机外壳", 左右边距=左右边距, 上边距=上边距, 下边距=下边距, 描边宽度=描边宽度,
                          手机颜色=手机颜色, 屏幕大小=(屏幕宽, 屏幕高), id_="手机外壳模板")

        屏幕大小 = 手机外壳模板.神笔模板返回值["屏幕大小"]
        屏幕位置 = 手机外壳模板.神笔模板返回值["屏幕位置"]

        手机外壳 = 手机外壳模板.创造元素(id_="手机外壳")

        手机屏幕 = 绘图板.神笔模板("手机屏幕", 屏幕大小=屏幕大小, 是否显示边缘=否, 是否锁屏=是,
                        id_="手机屏幕模板").创造元素(id_="手机屏幕").平移(*屏幕位置)

        return [手机屏幕, 手机外壳]


if __name__ == '__main__':
    左右边距 = 50
    上边距 = 50
    下边距 = 50
    描边宽度 = 2
    手机颜色 = "black"

    宽, 高 = 屏幕分辨率.我的手机()
    神笔 = 神笔绘图板(作品文件路径="智能手机.svg", 宽=宽 + 左右边距 * 2 + 描边宽度 * 2, 高=高 + 上边距 + 下边距 + 描边宽度 * 2)
    神笔.神笔模板("智能手机", 左右边距=左右边距, 上边距=上边距, 下边距=下边距, 描边宽度=描边宽度, 手机颜色=手机颜色,
            id_="智能手机模板").创造元素(id_="智能手机")
    神笔.完成()
    # https://svgtopng.com/zh/  SVG 转 PNG 滤镜支持
    # 神笔.生成PNG(生成方式=PNG生成方式.cairosvg, 缩放=3) # 不支持滤镜
