# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-04
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
import os

from 神笔码靓.码靓库.手机.手机绘图板 import 手机绘图板
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *
from 神笔码靓.神笔库.通用工具集 import *
import random


class 电视信号测试壁纸(手机绘图板):
    def __init__(self, 作品文件路径, 顶端标题=None, 顶端标题字体=None, 顶端标题缩放=1, 方格背景填充色=None, 方格背景描边色=None,
                 显示整机=否, 显示状态栏=是, 锁屏=是, 锁屏字体颜色=颜色.白色, 手机颜色="#163844"):
        self.屏幕宽, self.屏幕高 = 屏幕分辨率.我的手机()
        super(电视信号测试壁纸, self).__init__(作品文件路径=作品文件路径, 屏幕大小=(self.屏幕宽, self.屏幕高),
                                       显示整机=显示整机, 显示状态栏=显示状态栏, 锁屏=锁屏, 锁屏字体颜色=锁屏字体颜色, 手机颜色=手机颜色)
        # self.显示图框()
        if 顶端标题 is None:
            顶端标题 = "中央电视台"
        self.顶端标题 = 顶端标题
        if 方格背景填充色 is None:
            方格背景填充色 = "#000000"  # "#3F3F3F"  # "#808080"
        self.方格背景填充色 = 方格背景填充色
        if 方格背景描边色 is None:
            方格背景描边色 = "#ffffff"
        if 顶端标题字体 is None:
            顶端标题字体 = 系统字体.微软雅黑

        self.顶端标题字体 = 顶端标题字体
        self.方格背景描边色 = 方格背景描边色
        self.顶端标题缩放 = 顶端标题缩放

    def 满天星(self):
        for i in 范围(50):
            x = random.randint(50 * 10, self.屏幕宽 * 10 - 50 * 10) / 10.0
            y = random.randint(500, 4000) / 10.0
            大小 = random.randint(50, 200) / 10.0
            self.画四角星(x=x, y=y, 半径大小=大小 + 3, 填充颜色=颜色.白色, 描边宽度=0).模糊(5).透明度(0.8).添加到列表(self.屏幕元素列表)
            self.画四角星(x=x, y=y, 半径大小=大小, 填充颜色=颜色.白色, 描边宽度=0).透明度(0.8).添加到列表(self.屏幕元素列表)

    def 创作(self):
        测试图模板 = self.神笔模板("电视信号测试图", 中心位置=(self.屏幕宽 / 2, self.屏幕高 / 2), 圆半径=self.屏幕宽 / 2.4,
                          方格背景行列数=(26, 20),
                          方格背景填充色=self.方格背景填充色, 方格背景描边色=self.方格背景描边色,
                          顶端标题=self.顶端标题, 顶端标题缩放=self.顶端标题缩放, 顶端标题字体=self.顶端标题字体)

        电视信号测试图 = 测试图模板.创造元素(x=0, y=100).添加到列表(self.屏幕元素列表)
        增加渐变中间点 = [
            {"偏移": "15%", "透明度": 1, "颜色": self.方格背景填充色},
            {"偏移": "40%", "透明度": 0, "颜色": self.方格背景填充色},
            {"偏移": "55%", "透明度": 0, "颜色": self.方格背景填充色},
            {"偏移": "65%", "透明度": 0, "颜色": self.方格背景填充色},
            {"偏移": "85%", "透明度": 1, "颜色": self.方格背景填充色},
        ]

        渐变色 = self.创建线性渐变色(开始位置=(0, 0), 结束位置=(0, self.屏幕高),
                           开始透明度=1, 结束透明度=1,
                           开始颜色=self.方格背景填充色, 结束颜色=self.方格背景填充色, 增加渐变中间点=增加渐变中间点)

        self.画矩形(x=0, y=0, 宽=self.屏幕宽, 高=self.屏幕高, 填充颜色=渐变色).添加到列表(self.屏幕元素列表)
        self.写软件信息(x=self.屏幕宽 / 1.40, y=self.屏幕高 / 1.15, 字体大小=50, 填充颜色=颜色.白色, 是否转路径=是).添加到列表(self.屏幕元素列表)

        # self.满天星()

# if __name__ == '__main__':
#     神笔 = 电视信号测试壁纸("电视信号测试图")
#     神笔.完成()
