# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
import math

from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *
from 神笔码靓.码靓库.音乐.五线谱打印模板 import 五线谱打印模板

上边距 = 90
行间隔 = 100


class 五线谱大谱表1制作(五线谱打印模板):
    def 创作(self):
        for 行号 in 范围(5):
            if 行号 == 0:  # 第一行
                说明 = "钢琴"
            else:
                说明 = None
            self.高低音谱号记谱(y=行号 * 行间隔 * 2 + 上边距, 说明=说明)


class 五线谱大谱表2制作(五线谱打印模板):
    def 创作(self):
        for 行号 in 范围(5):
            self.高低音谱号记谱(y=行号 * 行间隔 * 2 + 上边距)


if __name__ == '__main__':
    宽, 高 = 纸张大小.A4_纵向(1)
    # 作品文件路径：保存的 SVG（矢量图）格式的文件路径名称
    # 宽: 神笔绘图板也需要设置页面的宽度
    # 高: 神笔绘图板也需要设置页面的高度
    神笔 = 五线谱大谱表1制作(作品文件路径="五线谱大谱表1.svg", 宽=宽, 高=高)
    神笔.完成()
    神笔.生成PDF()

    神笔 = 五线谱大谱表2制作(作品文件路径="五线谱大谱表2.svg", 宽=宽, 高=高)
    神笔.完成()
    神笔.生成PDF()
