# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.线条工具集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


class 竖排书法(神笔绘图板):
    def __init__(self, 作品文件路径, 宽=None, 高=None):
        super(竖排书法, self).__init__(作品文件路径=作品文件路径, 宽=宽, 高=高)
        self.显示图框()

    def 书写(self, 内容, 字体="汉仪大隶书繁", 字体大小=16,
           填充颜色=颜色.黑色, 描边颜色=颜色.黑色, 描边宽度=0, 描边样式=空,
           过滤的字符="-()\" .,，。"):
        内容 = re.sub(r'[' + 过滤的字符 + ']', '', 内容)
        内容 = 内容.split("\n")
        for 索引值, 竖排文字 in 索引列举(内容):
            x = 500 - 索引值 * 字体大小 * 1.25
            y = 50
            旋转点 = x, y
            self.写字(x=x, y=y, 文字=竖排文字.strip(" "), 字体=字体, 字体大小=字体大小, 填充颜色=填充颜色, 描边颜色=描边颜色,
                    描边宽度=描边宽度, 描边样式=描边样式,
                    水平基线对齐=文字水平基线对齐.起始点对齐).旋转(90, 旋转点).字旋转(-90)
