# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.学习.作文纸打印模板 import 作文纸打印模板
from 神笔码靓.神笔库.定义集 import *


def 作文纸打印模板制作():
    各种颜色 = {
        "红格": "#FF1919",
        "绿格": "#4B8059",
        "黑格": "#000000"
    }
    for 名称 in 各种颜色:
        作文纸模板 = 作文纸打印模板(作文纸文件路径=f"作文纸打印模板_{名称}.svg", 方格颜色=各种颜色[名称])
        作文纸模板.完成()


if __name__ == '__main__':
    作文纸打印模板制作()
