# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================

from 神笔码靓.码靓库.学习.田字格字帖模板 import *


def 毛笔字帖田字格制作(字帖配置列表):
    宽, 高 = 纸张大小.A4_纵向(纸张数=1)
    for 字帖配置 in 字帖配置列表:
        # 作品文件路径：保存的 SVG（矢量图）格式的文件路径名称
        # 宽: 神笔绘图板也需要设置页面的宽度
        # 高: 神笔绘图板也需要设置页面的高度
        毛笔字帖 = 田字格字帖模板(作品文件路径="毛笔字帖#后缀#", 宽=宽, 高=高)
        if 为空(字帖配置.字体):
            字帖配置.标题 = ""
        else:
            字帖配置.标题 = f"毛笔字练习({系统字体.中文名(字帖配置.字体)})"
        字帖配置.描边样式 = ""
        字帖配置.字体颜色 = 颜色.亮灰色
        字帖配置.描边宽度 = 1.2
        字帖配置.描边样式 = "4,2"
        毛笔字帖.增加配置项("字帖配置", 字帖配置)
        毛笔字帖.完成()
        毛笔字帖.生成PDF()


if __name__ == '__main__':
    # 这里定义字帖配置项
    字帖配置列表 = [
        田字格字帖配置(文字="床前明月光", 字体="小篆体", 文字微调=(0, 15), 字体大小=145, 行数=5, 列数=4),
        田字格字帖配置(文字="疑是地上霜", 字体=系统字体.华文行楷, 文字微调=(0, 15), 字体大小=145, 行数=5, 列数=4),
        田字格字帖配置(文字="举头望明月", 字体=系统字体.隶书, 文字微调=(0, 15), 字体大小=150, 行数=5, 列数=4),
        田字格字帖配置(文字="低头思故乡", 字体=系统字体.华文新魏, 文字微调=(0, 8), 字体大小=145, 文字辅助=否, 行数=5, 列数=4),
        田字格字帖配置(字体=无, 文字微调=(0, 5), 行数=6, 列数=4),
    ]
    毛笔字帖田字格制作(字帖配置列表=字帖配置列表)
