# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.学习.竖排书法 import 竖排书法
from 神笔码靓.神笔库.线条工具集 import *

庆余年监察院门口的碑文内容 = """
我希望庆国之法，为生民而立，不因高贵容忍，不因贫穷剥夺，无
不白之冤，无强加之罪，遵法如仗剑，破魍魉迷崇，不求神明。我希
望庆国之民，有真理可循，知礼义，守仁心，不以钱财论成败，不因
权势而屈从，同情弱小，痛恨不平，危难时坚心志，无人处常自省。　　
我希望这世间，再无压迫束缚，凡生于世，都能有活着的权利，有
自由的权利，亦有幸福的权利。愿终有一日，人人生而平等，再无
贵贱之分，守护生命，追求光明，此为我心所愿。虽万千曲折，不畏
前行，生而平等，人人如龙。　　　　　　　　　　　叶轻眉
    """


def 庆余年监察院门口的碑文():
    _竖排书法 = 竖排书法(作品文件路径="庆余年监察院门口的碑文.svg", 宽=520, 高=1150)
    _竖排书法.书写(庆余年监察院门口的碑文内容, 字体大小=45, 填充颜色=颜色.暗灰色)
    _竖排书法.完成()


def 碑文书法练习():
    _竖排书法 = 竖排书法(作品文件路径="庆余年监察院门口的碑文书法练习.svg", 宽=520, 高=1150)
    _竖排书法.书写(庆余年监察院门口的碑文内容, 字体大小=45, 填充颜色=颜色.透明, 描边颜色=颜色.黑色, 描边样式="0.5,0.5", 描边宽度=0.5)
    _竖排书法.完成()


if __name__ == '__main__':
    庆余年监察院门口的碑文()
    碑文书法练习()
