# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.学习.英语纸打印模板 import 英语纸打印模板
from 神笔码靓.神笔库.定义集 import *


def 英语纸打印模板制作():
    各种颜色 = {
        "红线": "#FF1919",
        "绿线": "#4B8059",
        "黑线": "#000000"
    }
    for 名称 in 各种颜色:
        作文纸 = 英语纸打印模板(作品文件路径=f"英语纸高清图_{名称}.svg", 线条颜色=各种颜色[名称])
        作文纸.完成()


if __name__ == '__main__':
    英语纸打印模板制作()
