# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-02
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.共用.诗经集 import 三字经
from 神笔码靓.码靓库.绘画.手机文字像素艺术画 import 手机文字像素艺术画
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *

if __name__ == '__main__':
    # 对三字经字符串进行处理：去回车符号、将逗号和句号替换为全角空格
    三字经_ = 三字经.strip().replace("\n", "").replace("，", "").replace("。", 全角空格)
    # 给三字经加标题和作者
    三字经_ = 全角空格 * 4 + f"三{全角空格}字{全角空格}经" + 全角空格 * 9 + f"王{全角空格}应{全角空格}麟" + 全角空格 * 5 \
           + 全角空格 * 28 + 三字经_

    背景色 = [颜色.白色, 颜色.黑色, 颜色.黑色, 颜色.白色, 颜色.白色, 颜色.白色, 颜色.黑色, 颜色.黑色, 颜色.黑色]
    for 索引号 in 范围(1, 2):
        图片路径 = 资源库目录(f"图片/手机壁纸/手机壁纸{索引号}.jpg")
        作品文件名, _ = 获取文件路径的文件名和扩展名(图片路径)
        神笔 = 手机文字像素艺术画(作品文件路径=作品文件名 + "_三字经像素艺术.svg", 文字内容=三字经_, 图片路径=图片路径,
                       像素列数=31, 左空字数=2, 右空字数=1, 上字空数=4, 图片左移像素点=0, 显示整机=是, 显示状态栏=是,
                       锁屏=是, 锁屏字体颜色="black", 手机颜色="black")
        神笔.画矩形(x=0, y=0, 宽=神笔.宽, 高=神笔.高, 填充颜色=背景色[索引号 - 1], 描边宽度=0)
        神笔.完成()
        # SVG 转 PNG 建议使用 https://svgtopng.com/zh/   滤镜支持
        # 神笔.生成PNG(生成方式=PNG生成方式.cairosvg, 缩放=2) # 不支持滤镜
