# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-15
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.手机彩虹矩阵壁纸 import 手机彩虹矩阵壁纸
from 神笔码靓.码靓库.手机.手机绘图板 import 手机绘图板
from 神笔码靓.神笔库 import 样式工具集
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


def 东方红手机壁纸(背景图片, 输出文件名, 缩放: [float, int] = 1.0, 背景图片位置微调=(0.0, 0.0)):
    左边距 = 170
    上边距 = 650
    # 1893年12月26日  2024年12月26日 冬月廿六
    绘图 = 手机绘图板(作品文件路径=输出文件名, 显示整机=否, 锁屏=是,
               锁屏时间="12:26", 锁屏日期="12月26日 冬月廿六", 锁屏步数="25000")
    矩形 = 绘图.画矩形(x=0, y=0, 宽=绘图.屏幕宽, 高=绘图.屏幕高, 填充颜色="#EE1C25").添加到列表(绘图.屏幕元素列表)

    绘图.导入SVG为组(x=左边距 + 背景图片位置微调[0], y=上边距 + 背景图片位置微调[1], SVG图片=背景图片).缩放(缩放).添加到列表(绘图.屏幕元素列表)
    绘图.导入SVG为组(x=左边距 + 30, y=上边距 + 500, SVG图片=资源库目录("图片/东方红.svg")).缩放(3).添加到列表(绘图.屏幕元素列表)

    # 东方红文字组 = 绘图.导入SVG为组(x=左边距 + 150, y=绘图.屏幕高 - 400, SVG图片=资源库目录("图片/东方红文字.svg")).缩放(0.9).添加到列表(绘图.屏幕元素列表)
    # for 元素 in 东方红文字组.元素列表:
    #     # 元素.填充颜色("#FFFF00")
    #     元素.样式字符串('fill:#EE1C25;', 覆盖=是)

    绘图.完成()
    绘图.生成PNG()


if __name__ == '__main__':
    东方红手机壁纸(背景图片=资源库目录("国旗/中国国旗.svg"), 输出文件名="手机壁纸_东风红_国旗.svg", 缩放=5, )
    东方红手机壁纸(背景图片=资源库目录("图片/党旗.svg"), 输出文件名="手机壁纸_东风红_党旗.svg", 缩放=4.5, 背景图片位置微调=(0, -50))
