# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-15
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.手机彩虹矩阵壁纸 import 手机彩虹矩阵壁纸
from 神笔码靓.码靓库.手机.手机绘图板 import 手机绘图板
from 神笔码靓.神笔库 import 样式工具集
from 神笔码靓.神笔库.元素库 import 可操作元素集合
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


def 中秋太极图手机壁纸(输出文件名, 文字, 文字颜色="#ffffff", 月亮图片="月亮.png", 背景颜色=None, 阴颜色=颜色.黑色, 阳颜色=颜色.白色):
    绘图 = 手机绘图板(作品文件路径=输出文件名, 显示整机=否, 锁屏=是)
    半径 = 绘图.屏幕宽 / 5
    太极图中心 = 绘图.屏幕宽 / 2, 绘图.屏幕高 / 1.4
    # 但愿人长久，千里共婵娟
    # 海上生明月，天涯共此时

    if 背景颜色 is None:
        背景颜色 = 阴颜色

    文字1, 文字2 = 文字.replace("，", ",").split(",")

    背景色 = 绘图.创建径向渐变色(渐变开始中心点=太极图中心, 渐变半径=半径 * 1.1, 开始颜色="#ffffff", 结束颜色=背景颜色,
                     开始偏移="0.2", 结束偏移="1.0", 增加渐变中间点=[{"偏移": ".8", "颜色": "#ffffff"}])

    矩形 = 绘图.画矩形(x=0, y=0, 宽=绘图.屏幕宽, 高=绘图.屏幕高, 填充颜色=背景色).添加到列表(绘图.屏幕元素列表)

    太极图模板 = 绘图.神笔模板("太极图", 半径=半径, 描边宽度=0, 描边颜色=阳颜色, 阴颜色=阴颜色, 阳颜色=阳颜色)
    字体大小 = 100

    文字元素列表 = 可操作元素集合(绘图)
    字体文件 = "小篆体.ttf"
    绘图.文字转路径(x=太极图中心[0] - 字体大小 * 1.5, y=太极图中心[1] - 字体大小 * 9.5, 文字=文字1,
             字体大小=字体大小, 纵向=是, 字体文件=字体文件, 描边宽度=0,
             填充颜色=文字颜色).添加到列表(文字元素列表)

    if "AI" in 文字2:
        文字位置微调 = {3: (20, 0), 4: (40, 0)}
    else:
        文字位置微调 = None

    绘图.文字转路径(x=太极图中心[0] + 字体大小 * 0.5, y=太极图中心[1] - 字体大小 * 9.5, 文字=文字2, 字体大小=字体大小,
             纵向=是, 字体文件=字体文件, 描边宽度=0, 文字位置微调=文字位置微调,
             填充颜色=文字颜色).添加到列表(文字元素列表)

    文字模板 = 文字元素列表.合并为模板()
    文字模板.创造元素().添加到列表(绘图.屏幕元素列表).模糊(5)
    文字模板.创造元素().添加到列表(绘图.屏幕元素列表)

    绘图.贴图(图片文件=资源库目录(f"图片/{月亮图片}"),
          x=太极图中心[0] - 半径 - 10,
          y=太极图中心[1] - 半径 - 8).添加到列表(绘图.屏幕元素列表).缩放(0.493)

    太极图模板.创造元素(x=太极图中心[0] - 半径, y=太极图中心[1] - 半径).添加到列表(绘图.屏幕元素列表).透明度(0.5)

    绘图.完成()
    # https://svgtopng.com/zh/
    # 免费定制中秋手机壁纸
    # 绘图.生成PNG()


if __name__ == '__main__':
    绘图屏幕宽, 绘图屏幕高 = 1080, 2376
    绘图宽, 绘图高 = 1188, 2644

    阴渐变色 = {"线性渐变": [
        {"偏移": ".1", "颜色": "#000000", "透明度": 1},
        {"偏移": ".65", "颜色": "#666666", "透明度": 0.0},
        {"偏移": ".9", "颜色": "#999999", "透明度": 0.0},
    ], "开始位置": (0, 0), "结束位置": (绘图宽 / 2, 0)}

    中秋太极图手机壁纸(输出文件名="手机壁纸_中秋太极图_但愿人长久.svg",
              文字="但愿人长久，千里共婵娟", 文字颜色="#FBFAC8", 月亮图片="月亮_黄.png",
              背景颜色=颜色.黑色, 阴颜色=阴渐变色, 阳颜色=颜色.白色)

    中秋太极图手机壁纸(输出文件名="手机壁纸_中秋太极图_海上生明月.svg",
              文字="海上生明月，天涯共此时",
              背景颜色=颜色.黑色, 阴颜色=阴渐变色, 阳颜色=颜色.白色)

    中秋太极图手机壁纸(输出文件名="手机壁纸_中秋太极图_壁纸赠粉丝.svg",
              文字="中秋佳节至，壁纸赠粉丝", 文字颜色="#FBFAC8", 月亮图片="月亮_黄.png",
              背景颜色=颜色.黑色, 阴颜色=阴渐变色, 阳颜色=颜色.白色)

    中秋太极图手机壁纸(输出文件名="手机壁纸_中秋太极图_定制赠粉丝.svg",
              文字="中秋留佳句，定制赠粉丝",
              背景颜色=颜色.黑色, 阴颜色=阴渐变色, 阳颜色=颜色.白色)

    中秋太极图手机壁纸(输出文件名="手机壁纸_中秋太极图_问询找AI.svg",
              文字="诗困无从起，问询找AI", 文字颜色="#FBFAC8", 月亮图片="月亮_黄.png",
              背景颜色=颜色.黑色, 阴颜色=阴渐变色, 阳颜色=颜色.白色)
