# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-22
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.手机彩虹矩阵壁纸 import 手机彩虹矩阵壁纸
from 神笔码靓.码靓库.手机.手机绘图板 import 手机绘图板
from 神笔码靓.神笔库 import 样式工具集
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


def 五星红旗手机壁纸(输出文件名):
    绘图 = 手机绘图板(作品文件路径=输出文件名, 显示整机=否, 锁屏=是,
               锁屏时间="10:01", 锁屏日期="10月01日 八月廿九", 锁屏步数="1001")
    背景红 = 绘图.画矩形(x=0, y=0, 宽=绘图.屏幕宽, 高=绘图.屏幕高, 填充颜色="#EE1C25").添加到列表(绘图.屏幕元素列表)

    # 绘图.导入SVG为组(x=左边距, y=绘图.屏幕高 - 下边距,
    #            SVG图片=资源库目录("国旗/中国国旗.svg")).旋转(-90).平移(-600, -175).缩放(7.3).透明度(0.5).添加到列表(绘图.屏幕元素列表)

    五角星列表 = 列表()
    x, y, 半径, 旋转角度 = 358, 绘图.屏幕高 - 420, 220, -18
    大五星 = 绘图.画五角星(x=x, y=y, 半径大小=半径, 描边宽度=0,
                  填充颜色=颜色.黄色).旋转(旋转角度).添加到列表(五角星列表)

    # 置前调试列表= []
    def 小五星创造后(小五星, 参数):
        位置信息 = 小五星.获取位置信息()
        位置信息.中心x, 位置信息.中心y
        小五星.旋转(参数["索引"] * (-22), (位置信息.中心x, 位置信息.中心y))

    小五星 = 绘图.画五角星(x=145, y=绘图.屏幕高 - 785, 半径大小=75, 描边宽度=0,
                  填充颜色=颜色.黄色).旋转(5)

    cx, cy = x + 47, y - 260
    小五星列表 = 绘图.环绕重复(重复元素=小五星, 环绕中心点=(cx, cy), 重复数量=4, 间距角=44.5,
                    元素创造后回调=小五星创造后).添加到列表(五角星列表)

    # 绘图.十字(x=cx, y=cy, 宽度=120, 高度=120, 颜色=颜色.白色).添加到列表(绘图.屏幕元素列表)
    # 绘图.画圆(x=cx, y=cy, 半径=290).添加到列表(绘图.屏幕元素列表)
    绘图.创建组合(元素列表=五角星列表).缩放(0.9).平移(40, 0).添加到列表(绘图.屏幕元素列表)

    绘图.完成()
    绘图.生成PNG(缩放=2)


if __name__ == '__main__':
    五星红旗手机壁纸("手机壁纸_五星红旗.svg")
