# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-15
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.手机彩虹矩阵壁纸 import 手机彩虹矩阵壁纸
from 神笔码靓.码靓库.手机.手机绘图板 import 手机绘图板
from 神笔码靓.神笔库 import 样式工具集
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


def 太极图手机壁纸(输出文件名, 背景颜色=None, 阴颜色=颜色.黑色, 阳颜色=颜色.白色):
    绘图 = 手机绘图板(作品文件路径=输出文件名, 显示整机=否, 锁屏=是)
    半径 = 绘图.屏幕宽 / 5
    太极图中心 = 绘图.屏幕宽 / 2, 绘图.屏幕高 / 1.8

    if 背景颜色 is None:
        背景颜色 = 阴颜色

    背景色 = 绘图.创建径向渐变色(渐变开始中心点=太极图中心, 渐变半径=半径 * 1.6, 开始颜色="#ffffff", 结束颜色=背景颜色,
                     开始偏移="0.2", 结束偏移="1.5", 增加渐变中间点=[{"偏移": ".6", "颜色": "#ffffff"}])

    矩形 = 绘图.画矩形(x=0, y=0, 宽=绘图.屏幕宽, 高=绘图.屏幕高, 填充颜色=背景色).添加到列表(绘图.屏幕元素列表)

    太极图模板 = 绘图.神笔模板("太极图", 半径=半径, 描边宽度=0, 描边颜色=阳颜色, 阴颜色=阴颜色, 阳颜色=阳颜色)
    # print(太极图模板.神笔模板返回值)
    太极图模板.创造元素(x=太极图中心[0] - 半径, y=太极图中心[1] - 半径).添加到列表(绘图.屏幕元素列表)

    绘图.完成()
    绘图.生成PNG()


if __name__ == '__main__':
    绘图屏幕宽, 绘图屏幕高 = 1080, 2376
    绘图宽, 绘图高 = 1188, 2644

    阴渐变色 = {"线性渐变": [
        {"偏移": ".1", "颜色": "#000000"},
        {"偏移": ".65", "颜色": "#999999"},
        {"偏移": ".9", "颜色": "#ffffff"},
    ], "开始位置": (0, 0), "结束位置": (绘图宽 / 2, 0)}
    太极图手机壁纸(输出文件名="手机壁纸_黑白太极图.svg", 背景颜色=颜色.黑色, 阴颜色=阴渐变色, 阳颜色=颜色.白色)

    阴渐变色 = {"径向渐变": [
        {"偏移": ".1", "颜色": "#ff0000"},
        {"偏移": ".3", "颜色": "#ff9999"},
        {"偏移": ".5", "颜色": "#ffffff"},
    ], "渐变开始中心点": (绘图宽 / 2, 0), "渐变半径": 绘图宽}
    太极图手机壁纸(输出文件名="手机壁纸_红白太极图.svg", 背景颜色=颜色.红色, 阴颜色=阴渐变色, 阳颜色=颜色.白色)
