# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-02
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.密度文字像素壁纸 import 密度文字像素壁纸
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


class 密度像素控制明暗壁纸(密度文字像素壁纸):
    def 遮罩背景颜色(self):
        return None

    def 计算亮度(self, r, g, b):
        return 0.299 * r + 0.587 * g + 0.114 * b

    def 计算灰度(self, r, g, b):
        return (r + g + b) / 3

    def 控制像素的形状大小颜色(self, 圆像素形状, 像素尺寸大小, 颜色RGB):
        r, g, b = 颜色RGB
        # 像素尺寸大小 = self.计算亮度(r, g, b)
        亮度值 = self.计算灰度(r, g, b)
        亮度率 = 亮度值 / 255
        暗度率 = 1 - 亮度率  # 像素尺寸大小和暗度率成正比
        像素尺寸大小 = 神笔.圆像素宽 * 暗度率 / 1.5
        填充颜色 = "black"
        return 圆像素形状, 像素尺寸大小, 填充颜色


if __name__ == '__main__':
    图片路径 = 资源库目录("图片/手机壁纸/超级玛丽.jpg")

    # 支持各种形状
    像素形状列表 = [("圆像素", 1), ("心形像素", 1), ("四边形像素", 1.3), ("五边形像素", 1.),
              ("六边形像素", 1.), ("菱形像素", 1), ("倒角方像素", 0.9)]
    # 像素形状列表 = [ ("五边形像素", 1.3)]

    for 像素形状, 像素缩放 in 像素形状列表:
        神笔 = 密度像素控制明暗壁纸(作品文件路径=f"手机壁纸_{像素形状}密度控制明暗.svg", 图片路径=图片路径, 密度文字颜色=颜色.黑色,
                        像素形状=像素形状, 像素缩放=像素缩放, 像素列数=50, 图片X偏移像素=30, 显示整机=是, 显示状态栏=是, 锁屏=是,
                        锁屏字体颜色="black", 手机颜色="#163844")

        神笔.完成()
        # SVG 转 PNG 建议使用 https://svgtopng.com/zh/   滤镜支持
        # 神笔.生成PNG(生成方式=PNG生成方式.cairosvg, 缩放=2) # 不支持滤镜
