# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-02
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.密度文字像素壁纸 import 密度文字像素壁纸
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *

if __name__ == '__main__':
    图片路径 = 资源库目录("图片/手机壁纸/超级玛丽.jpg")

    神笔 = 密度文字像素壁纸(作品文件路径="手机壁纸_彩虹背景文字像素.svg", 图片路径=图片路径, 密度文字颜色=颜色.白色,
                  像素列数=50, 图片X偏移像素=30,  密度文字列表="∷♂◎±ⅹ入八火尘千水齐花狐虾车老菜师滑尾象糊黄艚",
                  密度文字列表倒序=是, 显示整机=是, 显示状态栏=是, 锁屏=是,锁屏字体颜色=颜色.白色,手机颜色="#163844")

    神笔.完成()
    # SVG 转 PNG 建议使用 https://svgtopng.com/zh/   滤镜支持
    # 神笔.生成PNG(生成方式=PNG生成方式.cairosvg, 缩放=2) # 不支持滤镜
