# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-07-31
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.微信聊天窗口 import 微信聊天窗口制作
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *

if __name__ == '__main__':

    微信聊天列表 = [
        ("me", "嘿，你知道无限高清图是什么吗？"),
        ("pcr", "当然知道！无限高清图又称矢量图，矢量图就像是超级英雄，矢量图放大多少倍，它都不会失真，边缘依然那么清晰，线条还是那么平滑。"),
        ("me", " 哇，这么厉害！那它是怎么做到的？"),
        ("pcr", "因为矢量图是用数学公式来描述图形的，而不是像普通图片那样由一个个像素点堆砌起来。"),
        ("me", "原来是这样，那矢量图一般都用在哪些地方呀？"),
        ("pcr", "比如说标志设计、图标制作，还有印刷品，因为要保证高质量的输出。"),
        ("me", "那我以后可得多考虑用矢量图啦！"),
        ("pcr", "可以的，我做了一个“神笔码靓”，用代码自动来画图，目前已经有很多作品成果，如果不想编程，也可以直接用这些成果。"),
        ("me", "哦，哪里可以获取到呢？"),
        ("pcr", "可以搜索关键字“神笔码靓高清图”"),
        ("me", "哈哈，期待你的大作哦！加油！"),
        ("pcr", "好的，谢谢！"),
    ]

    头像1文件路径 = 资源库目录("图片/三月三印章.png")
    头像2文件路径 = 资源库目录("图片/Python超人.png")

    微信聊天 = 微信聊天窗口制作("微信聊天窗口_整机.svg", 对方名称="Python超人", 显示时间="23:59", 显示整机=是, 手机颜色="red")
    头像1 = 微信聊天.创建头像模板(头像1文件路径)
    头像2 = 微信聊天.创建头像模板(头像2文件路径)
    for 谁, 内容 in 微信聊天列表:
        if 谁 == "me":
            微信聊天.聊天消息(头像=头像1, 文字内容=内容, 左=False)
        else:
            微信聊天.聊天消息(头像=头像2, 文字内容=内容, 左=True)
    微信聊天.完成()
    微信聊天.生成PNG()

    微信聊天 = 微信聊天窗口制作("微信聊天窗口.svg", 对方名称="Python超人", 显示时间="23:59", 显示整机=否, 手机颜色="#163844")
    头像1 = 微信聊天.创建头像模板(头像1文件路径)
    头像2 = 微信聊天.创建头像模板(头像2文件路径)
    for 谁, 内容 in 微信聊天列表:
        if 谁 == "me":
            微信聊天.聊天消息(头像=头像1, 文字内容=内容, 左=False)
        else:
            微信聊天.聊天消息(头像=头像2, 文字内容=内容, 左=True)
    微信聊天.完成()
    微信聊天.生成PNG()
