# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-02
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.绘画.手机文字像素艺术画 import 手机文字像素艺术画
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *

if __name__ == '__main__':
    图片路径 = 资源库目录(f"图片/手机壁纸/超级玛丽.jpg")
    # 支持各种形状
    像素形状列表 = [("圆像素", 1), ("心形像素", 1), ("四边形像素", 1.3), ("五边形像素", 1.),
              ("六边形像素", 1.), ("菱形像素", 1), ("倒角方像素", 0.9)]
    像素形状列表 = [ ("心形像素", 1)]
    for 像素形状, 像素缩放 in 像素形状列表:
        神笔 = 手机文字像素艺术画(作品文件路径=f"手机壁纸_{像素形状}艺术.svg", 文字内容=None, 图片路径=图片路径,
                       像素形状=像素形状, 像素缩放=像素缩放, 像素透明度=1,
                       像素列数=50, 左空字数=2, 右空字数=1, 上字空数=4, 图片左移像素点=0, 显示整机=是, 显示状态栏=是,
                       锁屏=否, 锁屏字体颜色="black", 熄屏=否, 手机颜色="#163844", 显示图片=否)

        神笔.完成()
        # SVG 转 PNG 建议使用 https://svgtopng.com/zh/   滤镜支持
        神笔.生成PNG(生成方式=PNG生成方式.cairosvg, 缩放=2) # 不支持滤镜
        # break
