# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-04
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
import os

from 神笔码靓.码靓库.手机.电视信号测试壁纸 import 电视信号测试壁纸
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *
from 神笔码靓.神笔库.通用工具集 import *
import random

if __name__ == '__main__':
    宽, 高 = 屏幕分辨率.我的手机()
    渐变色参数 = {
        "开始位置": (0, 0),
        "结束位置": (宽, 高),
        "开始颜色": 颜色.黑色,
        "结束颜色": 颜色.黑色,
        "增加渐变中间点": [{"偏移": "80%", "颜色": 颜色.灰色, "透明度": 1.0}]
    }

    神笔 = 电视信号测试壁纸(作品文件路径="手机壁纸_电视信号测试图_黑背景.svg", 显示整机=是, 显示状态栏=是,
                  锁屏=是, 手机颜色=渐变色参数)
    神笔.完成()
    # SVG 转 PNG 建议使用 https://svgtopng.com/zh/   滤镜支持
    神笔.生成PNG(生成方式=PNG生成方式.cairosvg, 缩放=2)  # 不支持滤镜

    神笔 = 电视信号测试壁纸(作品文件路径="手机壁纸_电视信号测试图_蓝背景.svg", 显示整机=是, 显示状态栏=是,
                  锁屏=是, 顶端标题="神笔码靓电视台", 顶端标题字体=系统字体.隶书, 顶端标题缩放=0.8,
                  方格背景填充色="#3C4F77", 方格背景描边色="#3C4F77", 手机颜色="#163844")
    神笔.完成()
    # SVG 转 PNG 建议使用 https://svgtopng.com/zh/   滤镜支持
    神笔.生成PNG(生成方式=PNG生成方式.cairosvg, 缩放=2)  # 不支持滤镜
