# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-17
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.手机彩虹矩阵壁纸 import 手机彩虹矩阵壁纸
from 神笔码靓.码靓库.手机.手机绘图板 import 手机绘图板
from 神笔码靓.神笔库 import 样式工具集
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *

if __name__ == '__main__':
    # 1893年12月26日  2024年12月26日 冬月廿六
    绘图 = 手机绘图板(作品文件路径="手机壁纸_红墙怀旧经典.svg", 显示整机=是, 显示状态栏=是, 锁屏=是)
    砖列数 = 6
    砖宽 = 绘图.屏幕宽 / 砖列数
    砖高 = 砖宽 / 3
    砖线宽 = 2

    方法 = 1
    方法 = 2

    # 砖渐变色 = 绘图.创建线性渐变色(开始位置=(0, 砖高), 结束位置=(砖宽 / 3, 0), 开始颜色="#7C2921", 结束颜色="#000000", 开始透明度=1, 结束透明度=1)

    #  暗：#C23628   亮：#FF7957
    砖 = 绘图.画矩形(x=砖线宽, y=砖线宽, 宽=砖宽, 高=砖高, 填充颜色="#C23628",
               # 描边颜色=砖渐变色,
               描边宽度=砖线宽)
    if 方法 == 1:
        # 方法一：一个个的砖进行构建，代码简单，生成的文件比较大
        红墙 = 绘图.网格重复(重复元素=砖, 重复列数=砖列数 + 1, 列间距=砖宽, 重复行数=int(绘图.屏幕高 // 砖高) + 4,
                     行间距=砖高 + 砖线宽, 网格类型=网格重复类型.砖型交错).平移(-砖宽, 0).合并为组(id_="红墙").添加到列表(绘图.屏幕元素列表)
    elif 方法 == 2:
        # 方法二：反复嵌套模板，代码复杂，生成的文件小（小3倍左右）
        两层红墙 = 绘图.网格重复(重复元素=砖, 重复列数=砖列数 + 1, 列间距=砖宽, 重复行数=2,
                       行间距=砖高 + 砖线宽, 网格类型=网格重复类型.砖型交错).平移(-砖宽 / 2, 0)

        红墙 = 两层红墙
        # 循环创建重复元素模板，反复嵌套模板，无需构建一个个的砖
        for i in 范围(5):
            红墙 = 绘图.网格重复(重复元素=红墙, 重复列数=1, 列间距=0, 重复行数=2,
                         行间距=(砖高 + 砖线宽) * pow(2, i + 1), 网格类型=网格重复类型.砖型交错)
        红墙.添加到列表(绘图.屏幕元素列表)
        红墙 = 红墙.合并为组()
    else:
        红墙 = None

    渐变中间点 = [
        {"偏移": "18%", "透明度": 0.0, "颜色": 颜色.黑色},
        {"偏移": "55%", "透明度": 0.5, "颜色": 颜色.黑色},
    ]
    光照中间点X, 光照中间点Y = 绘图.屏幕宽 / 1.5, 绘图.屏幕高 / 1.5
    填充颜色 = 绘图.创建径向渐变色(渐变开始中心点=(光照中间点X, 光照中间点Y), 渐变半径=绘图.屏幕宽 * 1.5,
                      开始颜色=颜色.黑色, 开始透明度=0, 开始偏移=0,
                      结束颜色=颜色.黑色, 结束透明度=1, 结束偏移=1, 增加渐变中间点=渐变中间点)

    # 遮罩 = 绘图.画圆(x=光照中间点X, y=光照中间点Y, 半径=绘图.屏幕宽 * 1.5, 填充颜色=填充颜色).添加到列表(绘图.屏幕元素列表)

    遮罩 = 绘图.画矩形(x=0, y=0, 宽=绘图.屏幕宽, 高=绘图.屏幕高, 填充颜色=填充颜色).添加到列表(绘图.屏幕元素列表)

    # 逝去的青春 = 绘图.写字(x=绘图.屏幕宽 / 2, y=绘图.屏幕高 - 300, 文字="致我们逝去的青春",
    #               字体大小=130, 字体="手写行楷", 填充颜色="#ffffff").透明度(0.8).旋转(90).字旋转(-90).平移(-500, 200).阴影(). \
    #     添加到列表(绘图.屏幕元素列表)

    # 绘图.遮罩(遮罩元素_=遮罩, 被遮元素=[红墙]).添加到列表(绘图.屏幕元素列表)

    绘图.完成()
    绘图.生成PNG()
