# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-17
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手机.手机彩虹矩阵壁纸 import 手机彩虹矩阵壁纸
from 神笔码靓.码靓库.手机.手机绘图板 import 手机绘图板
from 神笔码靓.神笔库 import 样式工具集
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *

if __name__ == '__main__':
    左边距 = 170
    上边距 = 650
    # 1893年12月26日  2024年12月26日 冬月廿六
    绘图 = 手机绘图板(作品文件路径="手机壁纸_霓虹灯.svg", 显示整机=否, 锁屏=是,
               锁屏时间="12:26", 锁屏日期="12月26日 冬月廿六", 锁屏步数="25000")
    矩形 = 绘图.画矩形(x=0, y=0, 宽=绘图.屏幕宽, 高=绘图.屏幕高, 填充颜色="#000000").添加到列表(绘图.屏幕元素列表)


    绘图.写字(x=绘图.宽/2,y=400,文字="Hello",字体大小=100,填充颜色=颜色.黑色,描边宽度=3,描边颜色="#ffaaaa",字体=系统字体.微软雅黑).透明度(0.99).模糊(18).添加到列表(绘图.屏幕元素列表)
    绘图.写字(x=绘图.宽/2,y=400,文字="Hello",字体大小=100,填充颜色=颜色.红色,描边宽度=2,描边颜色="#ff9999",字体=系统字体.微软雅黑).透明度(0.99).添加到列表(绘图.屏幕元素列表)

    绘图.完成()
    绘图.生成PNG()
