# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-13
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.头像.头像模板工具 import 获取上身列表
from 神笔码靓.码靓库.头像.头像绘图板 import 头像绘图板
from 神笔码靓.码靓库.头像.头像颜色定义 import 常见发色, 常见肤色
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *
from 神笔码靓.码靓库.头像.头像元素 import 头像元素

if __name__ == '__main__':
    头像宽度 = 320
    缩放 = 0.5
    宽 = 头像宽度 * 缩放
    绘图板 = 头像绘图板("头像上衣展示.svg", 宽=宽 * 6, 高=宽 * 4)
    绘图板.显示图框()


    def 头像妹上衣(上身):
        头像妹 = 绘图板.头像妹().面部(1).头发(38).耳朵(2).上身(上身). \
            肤色(常见肤色.黄色).毛发颜色(常见发色.黑色).显示信息(显示部件="上身", 信息下移=0).创建().缩放(缩放)

        return 头像妹


    def 头像哥上衣(上身):
        头像哥 = 绘图板.头像哥().面部(1).头发(1).耳朵(2).上身(上身).眼睛旋转(180). \
            肤色(常见肤色.黄色).毛发颜色(常见发色.黑色).显示信息(显示部件="上身", 信息下移=0).创建().缩放(缩放)

        return 头像哥


    列号 = 0
    行号 = 0
    for 上身 in 获取上身列表("女"):
        头像妹上衣(上身).平移(列号 * 头像宽度, 行号 * 头像宽度)
        列号 = 列号 + 1
        if 列号 > 7:
            列号 = 0
            行号 = 行号 + 1

    列号 = 0
    行号 = 行号 + 1
    for 上身 in 获取上身列表("男"):
        头像哥上衣(上身).平移(列号 * 头像宽度, 行号 * 头像宽度)
        列号 = 列号 + 1
        if 列号 > 7:
            列号 = 0
            行号 = 行号 + 1

    绘图板.完成()
