# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-13
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.头像.头像绘图板 import 头像绘图板
from 神笔码靓.码靓库.头像.头像颜色定义 import 常见发色, 常见肤色
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *

if __name__ == '__main__':
    头像宽度 = 320
    缩放 = 0.5
    宽 = 头像宽度 * 缩放
    绘图板 = 头像绘图板("头像发色展示.svg", 宽=宽 * 8, 高=宽 * 9)
    绘图板.显示图框()

    颜色字典 = 常见发色.颜色字典()
    # 颜色字典 = {颜色名: 颜色字典[颜色名] for 颜色名 in 颜色字典 if 颜色名 != "白色"}
    颜色Keys = list(颜色字典.keys())

    颜色ID = -1


    def 头像妹发色():
        global 颜色ID
        颜色ID += 1
        if 颜色ID >= 返回长度(颜色字典):
            颜色ID = 0
        return 绘图板.头像妹().面部(1).头发(38).耳朵(2).上身(9).眼睛(3). \
            肤色(常见肤色.黄色).毛发颜色(颜色字典[颜色Keys[颜色ID]]).显示信息(显示部件="发色名"). \
            创建().缩放(缩放)


    def 头像哥发色():
        global 颜色ID
        颜色ID += 1
        if 颜色ID >= 返回长度(颜色字典):
            颜色ID = 0
        return 绘图板.头像哥().面部(1).头发(1).耳朵(2).上身(2).眼睛(1).嘴巴缩放(1, 2).嘴巴上下移动(-0.2). \
            肤色(常见肤色.黄色).毛发颜色(颜色字典[颜色Keys[颜色ID]]).显示信息(显示部件="发色名"). \
            创建().缩放(缩放)


    列号 = 0
    行号 = 0
    for _ in 范围(1, 返回长度(颜色Keys)):
        头像妹发色().平移(列号 * 头像宽度, 行号 * 头像宽度)
        列号 = 列号 + 1
        if 列号 > 7:
            列号 = 0
            行号 = 行号 + 1

    颜色ID = -1
    列号 = 0
    行号 = 行号 + 1
    for _ in 范围(1, 返回长度(颜色Keys)):
        头像哥发色().平移(列号 * 头像宽度, 行号 * 头像宽度)
        列号 = 列号 + 1
        if 列号 > 7:
            列号 = 0
            行号 = 行号 + 1

    绘图板.完成()
