# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-13
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.头像.头像绘图板 import 头像绘图板
from 神笔码靓.码靓库.头像.头像颜色定义 import 常见发色, 常见肤色
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


# 李大钊
# 单头像(头发="头发19", 面部="面部01", 性别="男", 眼睛="眼睛01", 眼镜="眼镜08", 眼镜在头发前=是, 胡须="胡须02",
#     上身="上身01", 眉毛="眉毛01", 眉毛颜色=颜色.黑色, 鼻子="鼻子01", 嘴巴="嘴巴01", 耳朵="耳朵02", 头发颜色=颜色.黑色, 胡须颜色=颜色.黑色)

# 爱因斯坦
# 单头像(头发="头发18", 面部="面部01", 性别="男", 眼睛="眼睛01", 眼镜=None, 眼镜在头发前=是, 胡须="胡须01",
#     上身="上身01", 眉毛="眉毛01", 眉毛颜色=颜色.黑色, 鼻子="鼻子01", 嘴巴="嘴巴01", 耳朵="耳朵02",
#     头发颜色=常见发色.白色, 胡须颜色=常见发色.白色)
# 陈佩斯
# 单头像(头发=None, 面部="面部01", 性别="男", 眼睛="眼睛01", 眼镜=None, 眼镜在头发前=是, 胡须="胡须01",
#     上身="上身01", 眉毛="眉毛01", 眉毛颜色=颜色.黑色, 鼻子="鼻子01", 嘴巴="嘴巴01", 耳朵="耳朵02",
#     头发颜色=常见发色.白色, 胡须颜色=常见发色.白色)
# 陈佩斯
# 单头像(头发=None, 面部="面部01", 性别="男", 眼睛="眼睛01", 眼镜=None, 眼镜在头发前=是, 胡须="胡须06",
#     上身="上身01", 眉毛="眉毛01", 眉毛颜色=颜色.黑色, 鼻子="鼻子01", 嘴巴="嘴巴01", 耳朵="耳朵02",
#     头发颜色=常见发色.白色, 胡须颜色=常见发色.白色)
def 鲁迅(绘图板: 头像绘图板):
    return 绘图板.头像哥().面部(1).眼睛(1).眼睛上下移动(-0.02).鼻子上下移动(-0.02).嘴巴上下移动(-0.01).眼睛缩放(0.9, 0.8). \
        头发(19).眉毛(1).胡须(4).肤色(常见肤色.黄色).毛发颜色(常见发色.黑色).创建()


def 陈佩斯(绘图板: 头像绘图板):
    return 绘图板.头像哥().面部(1).眼睛(1).眼睛缩放(0.9, 0.9). \
        无发().眉毛(1).胡须(1).肤色(常见肤色.黄色).毛发颜色(常见发色.白色).帽子(1).创建()


def 制作头像(绘图板: 头像绘图板):
    return 绘图板.头像哥().面部(2).面部缩放(0.75, 1).头发(26).头发缩放(0.75, 1).\
        眼睛(13).眼睛缩放(1,0.8).眼睛上下移动(-0.03).眼镜(7).眼镜缩放(0.75,1).眼镜上下移动(-0.03).\
        鼻子上下移动(-0.03).嘴巴上下移动(-0.02).\
        耳朵(2).耳朵缩放(0.75, 1.2).耳朵上下移动(-0.02).眉毛上下移动(-0.04).创建()


if __name__ == '__main__':
    绘图板 = 头像绘图板("头像制作.svg", 宽=320, 高=320)
    # 绘图板.贴图(x=0, y=0, 图片文件=资源库目录("图片/三月三.jpg")).缩放(0.26, 0.25).平移(230, 100)
    # 制作头像(绘图板).透明度(0.7)
    鲁迅(绘图板)
    # 绘图板.头像妹().面部(1).头发(38).耳朵(2).上身(9).眼睛(3).眼镜(8). \
    #     肤色(常见肤色.黄色).毛发颜色(常见发色.黑色). \
    #     创建模板().创造元素()
    #
    # 绘图板.头像哥().面部(1).头发(2).耳朵(2).上身(2). \
    #     肤色(常见肤色.黄色).毛发颜色(常见发色.黑色). \
    #     创建().平移(320, 0)

    # 绘图板.头像妹().面部(1).帽子(2).头发(2).头发缩放(0.9).耳朵(2).上身(9).眼睛(3).眼镜(8). \
    #     肤色(常见肤色.黄色).毛发颜色(常见发色.黑色). \
    #     创建模板().创造元素().平移(320, 0)
    #
    # 绘图板.头像哥().面部(1).眼睛(1).嘴巴(1).眉毛缩放(1,1.5).眉毛上下移动(0.05).\
    #     头发(2).耳朵(2).耳朵缩放(1.1, 1.1).耳朵左右移动(0.005).上身(2). \
    #     肤色(常见肤色.黄色).毛发颜色(常见发色.黑色). \
    #     创建().平移(320, 0)

    绘图板.完成()
