# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-13
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.头像.头像模板工具 import 获取胡须列表, 获取帽子列表
from 神笔码靓.码靓库.头像.头像绘图板 import 头像绘图板
from 神笔码靓.码靓库.头像.头像颜色定义 import 常见发色, 常见肤色
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


if __name__ == '__main__':
    头像宽度 = 320
    缩放 = 1
    宽 = 头像宽度 * 缩放
    绘图板 = 头像绘图板("头像帽子展示.svg", 宽=宽 * 8, 高=宽 * 9)
    绘图板.显示图框()


    def 头像妹帽子(帽子):
        return 绘图板.头像妹().面部(1).面部(1).耳朵(2).上身(1).头发(3). \
            肤色(常见肤色.黄色).帽子(帽子).毛发颜色(常见发色.黑色).显示信息(显示部件="帽子"). \
            创建().缩放(缩放)


    def 头像哥帽子(帽子):
        return 绘图板.头像哥().面部(1).耳朵(2).上身(1). \
            肤色(常见肤色.黄色).帽子(帽子).毛发颜色(常见发色.黑色).显示信息(显示部件="帽子"). \
            创建().缩放(缩放)


    列号 = 0
    行号 = 0
    for 帽子 in 获取帽子列表():
        头像妹帽子(帽子).平移(列号 * 头像宽度, 行号 * 头像宽度)
        列号 = 列号 + 1
        if 列号 > 7:
            列号 = 0
            行号 = 行号 + 1

    列号 = 0
    行号 = 行号 + 1
    for 帽子 in 获取帽子列表():
        头像哥帽子(帽子).平移(列号 * 头像宽度, 行号 * 头像宽度)
        列号 = 列号 + 1
        if 列号 > 7:
            列号 = 0
            行号 = 行号 + 1

    绘图板.完成()
