# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


# TODO: 以下是最简单的模板文件
class 神笔绘图板模板(神笔绘图板):
    def 页面设置(self, 设置: 纸张设置):
        # 输出 PDF 文件，以及 页面打印，在这里设置好
        设置.上页边距 = "0cm"
        设置.下页边距 = 0
        设置.左页边距 = "0cm"
        设置.右页边距 = 0
        设置.页面方向 = 纸张方向.自动识别
        设置.页面尺寸规格 = "A4"
        设置.页面缩放 = 1.0

    def 创作(self):
        # 注意：图框不会显示到 PDF 文件中，如果不希望SVG文件显示图框，可以注释或者删除以下代码
        # self.显示图框()
        # self.贴图(图片文件=资源库目录("图片/Python超人.png"))
        # self.显示网格(网格线距=20, 网格颜色=颜色.暗灰色, 网格透明度=1, 网格字体大小=9)
        _面部 = self.路径(描边颜色=颜色.红色).移动到(10, 10).画直线(300, 300).画水平线(100).闭合()
        xmin, xmax, ymin, ymax = _面部.获取边界框()
        # _面部.平滑路径()

        # self.画矩形(x=xmin,y=ymin,宽=xmax-xmin,高=ymax-ymin,描边颜色=颜色.蓝色)

        # _面部.显示中心点(颜色.红色)
        # TODO: 实现您的功能从这里开始
        # self.写字(x=100, y=100, 文字="制作从这里开始")


if __name__ == '__main__':
    # 作品文件路径：保存的 SVG（矢量图）格式的文件路径名称
    # 宽: 神笔绘图板也需要设置页面的宽度
    # 高: 神笔绘图板也需要设置页面的高度
    宽, 高 = 纸张大小.A4_横向(1)
    神笔 = 神笔绘图板模板(作品文件路径="我的神笔绘图板.svg", 宽=宽, 高=高)
    # 神笔.外联图片贴图=是
    神笔.完成()
    神笔.生成PDF()
