# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-07-25
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.生活娱乐.中国地图拼图 import 中国地图拼图
from 神笔码靓.神笔库 import 作品输出目录

if __name__ == '__main__':
    作品文件路径 = 作品输出目录("中国地图高清拼图")
    # 宽, 高 = 纸张大小.A4_横向()
    地图 = 中国地图拼图(作品文件路径=作品文件路径, 宽=777, 高=572)
    地图.完成()
    地图.生成PDF()
