# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-07-15
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.生活娱乐.中国象棋 import 中国象棋制作
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *

if __name__ == '__main__':
    神笔 = 中国象棋制作(文件路径="中国象棋单侧布局.svg", 棋子布局两侧=否,棋盘背景色="#F5D7A1", 棋盘格颜色="#916D3A")
    神笔.完成()
    神笔.生成PDF()

    神笔 = 中国象棋制作(文件路径="中国象棋两侧布局.svg", 棋盘背景色="#F5D7A1", 棋盘格颜色="#916D3A")
    神笔.完成()
    神笔.生成PDF()
