# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-07-06
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.生活娱乐.日历制作 import 日历制作
from 神笔码靓.神笔库.定义集 import *


if __name__ == '__main__':
    年份 = 2024
    纵向日历 = 日历制作(作品文件路径=f"{年份}年纵向日历.svg", 年份=年份, 周日为第一天=否, 横向=否)
    纵向日历.完成()
    纵向日历.生成PDF()

    横向日历 = 日历制作(作品文件路径=f"{年份}年横向日历.svg", 年份=年份, 周日为第一天=是, 横向=是)
    横向日历.完成()
    横向日历.生成PDF()
