# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-07-06
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================

from 神笔码靓.码靓库.绘画.三原色绘图板 import 三原色绘图板

if __name__ == '__main__':
    红黄蓝三原色 = 三原色绘图板(作品文件路径="红黄蓝三原色.svg", 颜色1="red", 颜色2="yellow", 颜色3="blue",
                    颜色12="orange", 颜色23="purple", 颜色31="green", 颜色123="black")
    红黄蓝三原色.完成()

    红绿蓝三原色 = 三原色绘图板(作品文件路径="红绿蓝三原色.svg", 颜色1="#ff0000", 颜色2="#00ff00", 颜色3="#0000ff",
                    颜色12="#ffff00", 颜色23="#ff00ff", 颜色31="#00ffff", 颜色123="#ffffff")
    红绿蓝三原色.完成()
