# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-17
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.PDF工具集 import PDF工具集
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板

if __name__ == '__main__':
    神笔 = 神笔绘图板(作品文件路径="超级玛丽倒影效果.svg", 宽=800, 高=1600)
    超级玛丽模板 = 神笔.神笔模板("超级玛丽", 显示帽子=否)
    # 倒影玛丽 = 超级玛丽模板.创造元素(x=0, y=0, id_="倒影玛丽").平移(0,1500).垂直翻转()
    倒影玛丽 = 超级玛丽模板.创造元素(x=0, y=0,
                       id_="倒影玛丽").平移(0, 1350).缩放(1, 0.8).垂直翻转().透明度(0.5)#.扰动(基频=0.001, 八度音阶数=2)
    超级玛丽 = 超级玛丽模板.创造元素(x=0, y=0, id_="超级玛丽")

    神笔.完成()
