# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.PDF工具集 import PDF工具集
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板

if __name__ == '__main__':
    神笔 = 神笔绘图板(作品文件路径="3个超级玛丽.svg", 宽=800, 高=800)
    超级玛丽模板 = 神笔.神笔模板("超级玛丽", 显示帽子=是)
    # 超级玛丽模板 = 神笔["超级玛丽"]
    超级玛丽 = 超级玛丽模板.创造元素(x=0, y=0, id_="超级玛丽")
    # # 在超级玛丽的眼中克隆一个和自己一样的小超级玛丽
    小玛丽 = 超级玛丽模板.创造元素(x=416.3, y=224.3, id_="小玛丽").缩放(0.003)
    超小玛丽 = 超级玛丽模板.创造元素(x=418.3, y=224.3, id_="超小玛丽").缩放(0.0001).水平翻转()
    神笔.完成()
