# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


class 立体效果球制作(神笔绘图板):
    def 页面设置(self, 设置: 纸张设置):
        设置.上页边距 = "4cm"
        设置.下页边距 = "0"
        设置.左页边距 = "0.1cm"
        设置.右页边距 = "0"
        设置.页面方向 = 纸张方向.纵向
        设置.页面尺寸规格 = "A4"
        设置.页面缩放 = 1.0

    def 创作(self):
        # self.显示图框()
        # self.显示网格(网格线距=20, 网格颜色=颜色.暗灰色, 网格透明度=1, 网格字体大小=9)

        _桌面路径点 = [(0, 350), (150, 250), (600, 250), (450, 350), (0, 350)]

        # self.连直线(_桌面路径点, 填充颜色=颜色.中紫罗兰色, 描边颜色=颜色.透明)

        self.画椭圆(280, 302, 半径=(120, 25), 填充颜色=颜色.RGB(30, 0, 0), 描边颜色=颜色.透明, 透明度=0.5).模糊(3).旋转(5)

        渐变中间点 = [
            {"偏移": ".4", "颜色": "#ff0000"},
            {"偏移": ".5", "颜色": "#ee0000"},
            {"偏移": ".9", "颜色": "#990000"},
        ]
        填充渐变色 = self.样式.创建径向渐变色(渐变开始中心点=(400, 170), 渐变半径=150,
                             开始颜色=颜色.RGB(255, 210, 210), 结束颜色=颜色.RGB(125, 0, 0),
                             开始偏移="0.1", 结束偏移="1.0",
                             增加渐变中间点=渐变中间点)
        self.画圆(350, 220, 半径=100, 填充颜色=填充渐变色, 描边颜色=颜色.透明)


if __name__ == '__main__':
    # 作品文件路径：保存的 SVG（矢量图）格式的文件路径名称
    # 宽: 神笔绘图板也需要设置页面的宽度
    # 高: 神笔绘图板也需要设置页面的高度
    宽, 高 = 纸张大小.A4_横向(1)
    神笔 = 立体效果球制作(作品文件路径="立体效果球.svg", 宽=宽, 高=高)
    神笔.完成()
    # 高清图.生成PDF()
