# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-05
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库 import 神笔模板
from 神笔码靓.神笔库.定义集 import *


class 水珠神笔模板(神笔模板):
    def 模板ID(self):
        return "水珠"

    def 元素列表(self):
        大小 = self.获取参数("大小", 100)
        嵌入物体 = self.获取参数("嵌入物体", None)
        绘图板 = self.绘图板
        x, y = 大小 * 1.8, 大小

        渐变中间点1 = [
            {"偏移": "40%", "透明度": 0.5, "颜色": 颜色.白色},
            {"偏移": "50%", "透明度": 0.3, "颜色": 颜色.白色},
            {"偏移": "80%", "透明度": 0.2, "颜色": 颜色.黑色},
            {"偏移": "85%", "透明度": 0.2, "颜色": 颜色.黑色},
            {"偏移": "90%", "透明度": 0.1, "颜色": 颜色.黑色},
            {"偏移": "95%", "透明度": 0.1, "颜色": 颜色.白色},
        ]
        渐变色1 = 绘图板.创建径向渐变色(渐变开始中心点=(x - 大小 * 0.7, y + 大小 * 0.7), 渐变半径=大小 * 2,
                           开始颜色=颜色.白色, 结束颜色=颜色.白色,
                           开始透明度=1, 结束透明度=0.8, 增加渐变中间点=渐变中间点1)
        x2, y2 = x - 大小 / 2, y + 大小 / 2
        渐变中间点2 = [
            {"偏移": "10%", "透明度": 0.2, "颜色": 颜色.白色},
            {"偏移": "20%", "透明度": 0.1, "颜色": 颜色.白色},
            {"偏移": "50%", "透明度": 0.1, "颜色": 颜色.黑色},
            {"偏移": "90%", "透明度": 0.4, "颜色": 颜色.黑色},
        ]

        渐变色2 = 绘图板.创建径向渐变色(渐变开始中心点=(x2, y2), 渐变半径=大小,
                           开始颜色=颜色.白色, 结束颜色=颜色.黑色,
                           开始透明度=1, 结束透明度=0.4, 增加渐变中间点=渐变中间点2)
        水珠元素列表 = []
        # 圆3 = self.画圆(x=x, y=y, 半径=大小, 描边宽度=0, 填充颜色=颜色.黑色).透明度(0.5).模糊(5)

        圆2 = 绘图板.画椭圆(x=x2, y=y2, 半径=(大小 * 1.2, 大小), 描边宽度=0, 填充颜色=渐变色2).旋转(-30)
        水珠元素列表.append(圆2)
        # 模板 = self.创建模板(元素列表=[圆2]).创造元素().旋转(45).缩放(1, 1.3).模糊(5).平移(-30, -300)
        # 水珠元素列表.添加元素(模板)
        圆1 = 绘图板.画圆(x=x, y=y, 半径=大小, 描边宽度=0, 填充颜色=渐变色1)
        水珠元素列表.append(圆1)
        # 亮圆1 = 绘图板.画矩形(x=x + 大小 / 2.5, y=y - 大小 / 2.5, 宽=大小 / 3, 高=大小 / 8,
        #               描边宽度=0, 圆角半径=(大小 / 8, 大小 / 14), 填充颜色=颜色.白色).旋转(60).缩放(1.2).平移(-3, -3).模糊(大小 / 60)
        亮圆2 = 绘图板.画矩形(x=x + 大小 / 2.5, y=y - 大小 / 2.5, 宽=大小 / 3, 高=大小 / 8,
                      描边宽度=0, 圆角半径=(大小 / 8, 大小 / 14), 填充颜色=颜色.白色).旋转(60).透明度(0.9).模糊(0.8)

        # 亮闪闪 = self.绘图板.画四角星(x=x2, y=y2, 半径大小=大小 / 2, 内角点占比=0.1, 描边宽度=0, 填充颜色=颜色.白色)
        # 水珠元素列表.append(亮闪闪)
        水珠元素列表.append(亮圆2)
        if 嵌入物体:
            水珠元素列表.append(嵌入物体)
        return 水珠元素列表
