# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-07-23
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库 import 五角星绘画路径, 五角星路径
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


class 神笔码靓图标设计(神笔绘图板):
    """
    将图像进行变形，平铺在桌面或者地板上，可以看到的立体画
    """

    def __init__(self, 文件路径):  # 765.4 1133.9
        super(神笔码靓图标设计, self).__init__(作品文件路径=文件路径, 宽=480, 高=480)
        self.显示图框()

    def 创作(self):
        self.SVG贴图(图片文件=资源库目录("素材/神笔.svg"))

        # 神1 = self.文字转路径(x=0, y=0, 文字="神", 字体大小=900, 字体文件="上首逍遥书法体.ttf",
        #                填充颜色="#aaaaaa", 透明度=1, 描边宽度=0, 描边颜色="#eeeeee").平移(40, -160)
        # 神 = self.文字转路径(x=0, y=0, 文字="神", 字体大小=490, 字体文件="中山行书字体.ttf",
        #                填充颜色="#222222", 透明度=1, 描边宽度=0, 描边颜色="#CEAD1D").平移(-8, -95)
        # self.矩形裁剪(x=0, y=0, 高=500, 宽=220, 被裁元素=神)
        # 日 = self.文字转路径(x=0, y=0, 文字="日", 字体大小=500, 字体文件=字体文件目录("中山行书字体.ttf"),
        #                填充颜色="#666666", 透明度=1, 描边宽度=5, 描边颜色="#000000").平移(120, -20).缩放(1, 1.35)
        # self.矩形裁剪(x=100, y=0, 高=200, 宽=300, 被裁元素=日)
        self.SVG贴图(图片文件=资源库目录("素材/毛笔.svg")).缩放(0.45).平移(625, 75)\
            .颜色替换("#a0005f","#000000").颜色替换("#bc086b","#333333").颜色替换("#ef3388","#666666")

        self.文字转路径(x=0, y=0, 文字="码靓", 字体大小=50, 字体文件=字体文件目录("小篆体.ttf"),纵向=是,
                   填充颜色="#F4CD27", 透明度=1, 描边宽度=1, 描边颜色="#CEAD1D").平移(310, 50)


if __name__ == '__main__':
    神笔 = 神笔码靓图标设计(文件路径="神笔码靓图标设计.svg")
    神笔.完成()
    神笔.生成PNG(缩放=3)
