# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-07-23
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================

from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


class 裸眼3D图(神笔绘图板):
    """
    TODO: 未完成
    使用平行眼，才能看到的三维立体图
    """

    def __init__(self, 作品文件路径):
        宽, 高 = 纸张大小.A4_横向()
        super(裸眼3D图, self).__init__(作品文件路径=作品文件路径, 宽=宽, 高=高, 视图区=f"0 0 {宽} {高}")
        self.显示图框()

    def 创作(self):
        font_file = 字体文件目录("小篆体.ttf")
        图片文件 = 资源库目录("图片/wallpaper_a6.jpg")

        # 背景图片 =self.贴图(x=0,y=0,图片文件=图片文件)

        # 背景图片1 = self.贴图(x=-20, y=0, 图片文件=图片文件)
        # 文字1 = self.文字转路径(x=200, y=200, 文字="你好", 字体文件=font_file, 字体大小=300, 字符间距="10%",
        #                 描边宽度=1,
        #            # 垂直基线对齐=文字垂直基线对齐.中线对齐, 水平基线对齐=文字水平基线对齐.中点对齐
        #            # 垂直基线对齐=文字垂直基线对齐.顶线对齐, 水平基线对齐=文字水平基线对齐.起始点对齐
        #            # 垂直基线对齐=文字垂直基线对齐.底线对齐, 水平基线对齐=文字水平基线对齐.结束点对齐
        #            )

        背景图片2 = self.贴图(x=20, y=0, 图片文件=图片文件)
        文字2 = self.文字转路径(x=400, y=200, 文字="你好", 字体文件=font_file, 字体大小=300, 字符间距="10%",
                         描边宽度=1, 填充颜色=颜色.白色
                         # 垂直基线对齐=文字垂直基线对齐.中线对齐, 水平基线对齐=文字水平基线对齐.中点对齐
                         # 垂直基线对齐=文字垂直基线对齐.顶线对齐, 水平基线对齐=文字水平基线对齐.起始点对齐
                         # 垂直基线对齐=文字垂直基线对齐.底线对齐, 水平基线对齐=文字水平基线对齐.结束点对齐
                         )
        # self.裁剪(裁剪元素=文字1, 被裁元素=背景图片1)
        self.遮罩(遮罩元素_=文字2, 被遮元素=背景图片2)
        # self.裁剪(裁剪元素=文字2, 被裁元素=背景图片2)
        # self.文字转路径().写字(x=self.宽 / 2, y=self.高 / 2, 文字="你好", 字体="").转路径元素()


if __name__ == '__main__':
    神笔 = 裸眼3D图(作品文件路径="裸眼3D图.svg")
    神笔.完成()
