# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-07-09
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
import os

from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *
from 神笔码靓.码靓库.共用.国家简码 import 国家简码


class 评分表情包(神笔绘图板):

    def __init__(self, 作品文件路径):
        宽, 高 = 527, 85
        super(评分表情包, self).__init__(作品文件路径=作品文件路径, 宽=宽, 高=高, 视图区=f"0 0 {宽} {高}")

        self.表情包配置 = [
            [self.眯着眼睛, self.瘪着嘴],
            [self.圆圆眼睛, self.瘪着嘴],
            [self.圆圆眼睛, self.歪着嘴],
            [self.圆圆眼睛, self.微笑嘴],
            [self.圆圆眼睛, self.大笑嘴],
        ]
        self.表情包颜色 = ["#E7374E", "#F6841B", "#FFCD2E", "#ACDA18", "#53C957"]

    def 眯着眼睛(self, x, y):
        self.连线([("移动", 23 + x, 31 + y),
                 ("直线", 29 + x, 35 + y),
                 ("直线", 23 + x, 39 + y),
                 ("移动", 67 + x, 31 + y), ("直线", 61 + x, 35 + y),
                 ("直线", 68 + x, 39 + y)], 描边宽度=3, 透明度=0.5)

    def 圆圆眼睛(self, x, y):
        self.画圆(x=x + 27, y=y + 38, 半径=4, 填充颜色=颜色.黑色, 描边宽度=0, 透明度=0.5)
        self.画圆(x=x + 67, y=y + 38, 半径=4, 填充颜色=颜色.黑色, 描边宽度=0, 透明度=0.5)

    def 瘪着嘴(self, x, y):
        self.连线([("移动", 35 + x, 56 + y), ("椭圆弧线", 45, 200, 0, 0, 1, 59 + x, 56 + y)], 描边宽度=3, 透明度=0.5)

    def 歪着嘴(self, x, y):
        self.连线([("移动", 35 + x, 48 + y), ("直线", 53 + x, 55 + y)], 描边宽度=3, 透明度=0.5)

    def 微笑嘴(self, x, y):
        self.连线([("移动", 35 + x, 50 + y), ("椭圆弧线", 45, 200, 0, 0, 0, 59 + x, 50 + y)], 描边宽度=3, 透明度=0.5)

    def 大笑嘴(self, x, y):
        self.连线([("移动", 31 + x, 47 + y), ("椭圆弧线", 45, 200, 0, 0, 0, 63 + x, 47 + y), "关闭"],
                填充颜色=颜色.黑色, 描边宽度=0, 透明度=0.5)

    def 创作(self):
        # self.显示图框()
        # self.显示网格(网格线距=10, 网格颜色=颜色.黑色, 网格字体大小=6, 线条样式="3,3")
        # self.贴图(x=0, y=0, 图片文件=资源库目录("素材/表情评分.png"))
        左右边距 = 8
        半径 = 38
        间隔 = (527 - 2 * (左右边距 + 半径)) / 4
        for i in 范围(5):
            cx, cy = (左右边距 + 半径) + i * 间隔, self.高 / 2
            颜色_ = self.表情包颜色[i]
            self.画圆(x=cx, y=cy, 半径=半径, 填充颜色=颜色_, 描边宽度=0, 透明度=1)
            表情配置_ = self.表情包配置[i]
            for 配置_ in 表情配置_:
                配置_(x=i * 间隔, y=0)


if __name__ == '__main__':
    神笔 = 评分表情包(作品文件路径="评分表情包.svg")
    神笔.完成()
