# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库 import 神笔模板
from 神笔码靓.神笔库.定义集 import *


class 超级玛丽神笔模板(神笔模板):
    def 模板ID(self):
        return "超级玛丽"

    def 左鞋(self):
        _鞋底色 = self.绘图板.创建线性渐变色(开始位置=(624.02, 553.06), 结束位置=(676.55, 577.44),
                                开始颜色="#666767", 结束颜色="#fcfcfc",
                                开始偏移=0.01, 结束偏移=0.97)
        # _鞋底色 = "#666767"  # TODO: 未使用渐变色

        _左鞋底 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_鞋底色). \
            移动到(x=672, y=480). \
            平滑曲线(终点控制点=(679, 487), 终点=(683, 497)). \
            画曲线(开始控制点=(689, 512), 终点控制点=(676, 549), 终点=(645, 587)). \
            画曲线(开始控制点=(644, 592), 终点控制点=(642, 599), 终点=(638, 608)). \
            画曲线(开始控制点=(632, 624), 终点控制点=(628, 634), 终点=(620, 638)). \
            画曲线(开始控制点=(608, 644), 终点控制点=(591, 638), 终点=(576, 626)). \
            画曲线(开始控制点=(585, 627), 终点控制点=(590, 622), 终点=(593, 620)). \
            画曲线(开始控制点=(606, 614), 终点控制点=(605, 600), 终点=(619, 576)). \
            画曲线(开始控制点=(625, 565), 终点控制点=(625, 562), 终点=(628, 555)). \
            画曲线(开始控制点=(639, 537), 终点控制点=(652, 518), 终点=(649, 467)). \
            画曲线(开始控制点=(653, 469), 终点控制点=(666, 473), 终点=(672, 480))

        _左鞋色 = self.绘图板.创建线性渐变色(开始位置=(527.97, 516.9), 结束位置=(654.31, 564.32),
                                开始颜色="#5b2908", 结束颜色="#b16732",
                                开始偏移=0.11, 结束偏移=1)

        # _左鞋色 = "#80390d"  # TODO: 未使用渐变色

        _左鞋 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_左鞋色). \
            移动到(x=536, y=519). \
            画曲线(开始控制点=(552, 471), 终点控制点=(551, 469), 终点=(558, 462)). \
            画曲线(开始控制点=(570, 449), 终点控制点=(594, 436), 终点=(619, 444)). \
            画曲线(开始控制点=(636, 449), 终点控制点=(651, 464), 终点=(654, 481)). \
            画曲线(开始控制点=(656, 490), 终点控制点=(654, 497), 终点=(650, 510)). \
            画曲线(开始控制点=(645, 527), 终点控制点=(637, 549), 终点=(624, 575)). \
            画曲线(开始控制点=(622, 581), 终点控制点=(619, 590), 终点=(613, 600)). \
            画曲线(开始控制点=(605, 614), 终点控制点=(597, 628), 终点=(582, 634)). \
            画曲线(开始控制点=(563, 641), 终点控制点=(538, 632), 终点=(527, 615)). \
            画曲线(开始控制点=(521, 606), 终点控制点=(521, 597), 终点=(520, 586)). \
            画曲线(开始控制点=(519, 566), 终点控制点=(524, 553), 终点=(536, 519))

        return [_左鞋底, _左鞋]

    def 左手臂(self):

        _左手臂 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色="#e62901"). \
            移动到(x=486, y=442). \
            画曲线(开始控制点=(513, 426), 终点控制点=(531, 403), 终点=(547, 377)). \
            画曲线(开始控制点=(600, 293), 终点控制点=(610, 226), 终点=(612, 209)). \
            画曲线(开始控制点=(613, 203), 终点控制点=(613, 199), 终点=(614, 195)). \
            画曲线(开始控制点=(597, 191), 终点控制点=(581, 187), 终点=(565, 182)). \
            画曲线(开始控制点=(560, 185), 终点控制点=(552, 191), 终点=(542, 198)). \
            画曲线(开始控制点=(445, 273), 终点控制点=(433, 384), 终点=(437, 423)). \
            画曲线(开始控制点=(438, 436), 终点控制点=(442, 446), 终点=(449, 450)). \
            画曲线(开始控制点=(453, 452), 终点控制点=(462, 456), 终点=(486, 442))

        _左手套色 = self.绘图板.创建线性渐变色(开始位置=(490.47, 179.22), 结束位置=(659.9, 131.81),
                                 开始颜色="#666767", 结束颜色="#fcfcfc",
                                 开始偏移=0.01, 结束偏移=0.97)
        # _左手套色 = "#fcfcfc"  # TODO: 未使用渐变色
        _左手套 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_左手套色). \
            移动到(x=554, y=243). \
            画曲线(开始控制点=(591, 249), 终点控制点=(591, 266), 终点=(626, 241)). \
            画曲线(开始控制点=(641, 230), 终点控制点=(635, 214), 终点=(636, 205)). \
            画曲线(开始控制点=(632, 208), 终点控制点=(621, 211), 终点=(605, 210)). \
            画曲线(开始控制点=(592, 209), 终点控制点=(583, 203), 终点=(579, 201)). \
            画曲线(开始控制点=(588, 205), 终点控制点=(600, 211), 终点=(613, 210)). \
            画曲线(开始控制点=(622, 210), 终点控制点=(632, 209), 终点=(642, 202)). \
            画曲线(开始控制点=(659, 191), 终点控制点=(672, 155), 终点=(671, 135)). \
            画曲线(开始控制点=(667, 88), 终点控制点=(638, 77), 终点=(603, 71)). \
            画曲线(开始控制点=(601, 68), 终点控制点=(597, 63), 终点=(590, 58)). \
            画曲线(开始控制点=(577, 49), 终点控制点=(559, 52), 终点=(547, 60)). \
            画曲线(开始控制点=(537, 67), 终点控制点=(533, 77), 终点=(532, 81)). \
            画曲线(开始控制点=(536, 80), 终点控制点=(558, 76), 终点=(578, 94)). \
            画曲线(开始控制点=(582, 97), 终点控制点=(587, 104), 终点=(588, 114)). \
            画曲线(开始控制点=(589, 125), 终点控制点=(582, 134), 终点=(581, 136)). \
            画曲线(开始控制点=(594, 153), 终点控制点=(603, 156), 终点=(610, 156)). \
            画曲线(开始控制点=(618, 155), 终点控制点=(630, 153), 终点=(632, 152)). \
            画曲线(开始控制点=(632, 152), 终点控制点=(632, 152), 终点=(632, 152)). \
            画曲线(开始控制点=(632, 154), 终点控制点=(613, 157), 终点=(606, 156)). \
            画曲线(开始控制点=(597, 154), 终点控制点=(585, 142), 终点=(581, 136)). \
            画曲线(开始控制点=(582, 135), 终点控制点=(588, 128), 终点=(588, 114)). \
            画曲线(开始控制点=(588, 101), 终点控制点=(575, 90), 终点=(568, 87)). \
            画曲线(开始控制点=(566, 85), 终点控制点=(543, 74), 终点=(522, 84)). \
            画曲线(开始控制点=(504, 93), 终点控制点=(486, 127), 终点=(485, 156)). \
            画曲线(开始控制点=(484, 176), 终点控制点=(496, 188), 终点=(500, 197)). \
            画曲线(开始控制点=(499, 197), 终点控制点=(496, 200), 终点=(494, 209)). \
            画曲线(开始控制点=(493, 213), 终点控制点=(494, 217), 终点=(495, 218)). \
            画曲线(开始控制点=(503, 234), 终点控制点=(540, 241), 终点=(554, 243))
        return [_左手臂, _左手套]

    def 上身(self):
        _红色内衣色 = self.绘图板.创建线性渐变色(开始位置=(172.89, 435.23), 结束位置=(350.55, 515.93),
                                  开始颜色="#710608", 结束颜色="#f00e12",
                                  开始偏移=0.6, 结束偏移=0.8)
        # _红色内衣色 = "#f00e12"  # TODO: 未使用渐变色
        _红色内衣 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_红色内衣色). \
            移动到(x=459, y=418). \
            画曲线(开始控制点=(487, 432), 终点控制点=(528, 457), 终点=(540, 504)). \
            画曲线(开始控制点=(556, 562), 终点控制点=(520, 631), 终点=(452, 656)). \
            画曲线(开始控制点=(387, 680), 终点控制点=(317, 660), 终点=(276, 618)). \
            画曲线(开始控制点=(252, 594), 终点控制点=(242, 567), 终点=(237, 551)). \
            画曲线(开始控制点=(243, 477), 终点控制点=(283, 416), 终点=(339, 399)). \
            画曲线(开始控制点=(389, 384), 终点控制点=(435, 406), 终点=(459, 418))

        _外衣兜兜色 = self.绘图板.创建线性渐变色(开始位置=(273.21, 648.52), 结束位置=(511.46, 451.53),
                                  开始颜色="#081e4d", 结束颜色="#1950c5",
                                  开始偏移=0.4, 结束偏移=0.8)
        # _外衣兜兜色 = "#1950c5"  # TODO: 未使用渐变色
        _外衣兜兜 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_外衣兜兜色). \
            移动到(x=459, y=421). \
            画曲线(开始控制点=(469, 414), 终点控制点=(518, 446), 终点=(535, 489)). \
            画曲线(开始控制点=(555, 538), 终点控制点=(534, 603), 终点=(490, 638)). \
            画曲线(开始控制点=(439, 677), 终点控制点=(375, 671), 终点=(325, 658)). \
            画曲线(开始控制点=(291, 649), 终点控制点=(235, 622), 终点=(230, 586)). \
            画曲线(开始控制点=(226, 553), 终点控制点=(240, 507), 终点=(246, 503)). \
            画曲线(开始控制点=(251, 511), 终点控制点=(283, 532), 终点=(287, 534)). \
            画曲线(开始控制点=(311, 548), 终点控制点=(346, 540), 终点=(363, 520)). \
            画曲线(开始控制点=(384, 496), 终点控制点=(381, 451), 终点=(349, 422)). \
            画曲线(开始控制点=(370, 430), 终点控制点=(392, 438), 终点=(414, 446)). \
            画曲线(开始控制点=(422, 456), 终点控制点=(430, 466), 终点=(437, 476)). \
            画曲线(开始控制点=(453, 473), 终点控制点=(468, 469), 终点=(483, 465)). \
            画直线(终点x=457, 终点y=431). \
            画曲线(开始控制点=(456, 428), 终点控制点=(456, 423), 终点=(459, 421))

        _右纽扣色 = self.绘图板.创建径向渐变色(渐变开始中心点=(450, 520), 渐变半径=45,
                                 开始颜色="#ffff2d", 结束颜色="#ada406",
                                 开始偏移=0.2, 结束偏移=0.9)
        # _右纽扣色 = "#ffff2d"  # TODO: 未使用渐变色
        _右纽扣 = self.绘图板.画椭圆(x=430.28, y=522.04, 半径=(33.28, 33.45), 描边颜色=颜色.透明, 填充颜色=_右纽扣色)

        _左纽扣色 = self.绘图板.创建径向渐变色(渐变开始中心点=(560, 500), 渐变半径=50,
                                 开始颜色="#ffff2d", 结束颜色="#ada406",
                                 开始偏移=0.5, 结束偏移=0.8)
        # _左纽扣色 = "#ffff2d"  # TODO: 未使用渐变色
        _左纽扣 = self.绘图板.画椭圆(x=534.05, y=499.32, 半径=(9.98, 31.11), 描边颜色=颜色.透明, 填充颜色=_左纽扣色).旋转(-22)

        return [_红色内衣, _外衣兜兜, _右纽扣, _左纽扣]

    def 右鞋(self):
        _鞋底色 = self.绘图板.创建线性渐变色(开始位置=(624.02, 553.06), 结束位置=(676.55, 577.44),
                                开始颜色="#666767", 结束颜色="#fcfcfc",
                                开始偏移=0.1, 结束偏移=0.9)
        # _鞋底色 = "#666767"  # TODO: 未使用渐变色

        _右鞋底 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_鞋底色). \
            移动到(x=211, y=668). \
            画曲线(开始控制点=(206, 688), 终点控制点=(201, 708), 终点=(202, 733)). \
            画曲线(开始控制点=(202, 747), 终点控制点=(204, 758), 终点=(206, 765)). \
            画曲线(开始控制点=(200, 765), 终点控制点=(191, 763), 终点=(184, 756)). \
            画曲线(开始控制点=(171, 745), 终点控制点=(172, 727), 终点=(172, 713)). \
            画曲线(开始控制点=(173, 685), 终点控制点=(183, 663), 终点=(192, 649)). \
            画曲线(开始控制点=(190, 637), 终点控制点=(189, 628), 终点=(190, 620)). \
            画曲线(开始控制点=(190, 605), 终点控制点=(190, 584), 终点=(203, 576)). \
            画曲线(开始控制点=(204, 575), 终点控制点=(239, 584), 终点=(245, 587)). \
            画曲线(开始控制点=(251, 589), 终点控制点=(234, 586), 终点=(234, 601)). \
            画曲线(开始控制点=(234, 626), 终点控制点=(218, 638), 终点=(211, 668))

        _右鞋色 = self.绘图板.创建线性渐变色(开始位置=(201.36, 686.54), 结束位置=(335.95, 681.13),
                                开始颜色="#5b2908", 结束颜色="#b16732",
                                开始偏移=0.11, 结束偏移=1)
        # _右鞋色 = "#80390d"  # TODO: 未使用渐变色
        _右鞋 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_右鞋色). \
            移动到(x=249, y=788). \
            画曲线(开始控制点=(272, 788), 终点控制点=(303, 775), 终点=(312, 748)). \
            画曲线(开始控制点=(316, 736), 终点控制点=(314, 725), 终点=(313, 718)). \
            画曲线(开始控制点=(316, 718), 终点控制点=(320, 716), 终点=(325, 713)). \
            画曲线(开始控制点=(331, 707), 终点控制点=(334, 699), 终点=(334, 668)). \
            画曲线(开始控制点=(335, 626), 终点控制点=(329, 620), 终点=(326, 617)). \
            画曲线(开始控制点=(321, 613), 终点控制点=(312, 607), 终点=(306, 611)). \
            画曲线(开始控制点=(302, 615), 终点控制点=(299, 613), 终点=(292, 646)). \
            画曲线(开始控制点=(288, 668), 终点控制点=(292, 684), 终点=(291, 684)). \
            画曲线(开始控制点=(291, 684), 终点控制点=(288, 666), 终点=(292, 646)). \
            画曲线(开始控制点=(296, 631), 终点控制点=(298, 617), 终点=(306, 611)). \
            画曲线(开始控制点=(301, 604), 终点控制点=(293, 595), 终点=(280, 589)). \
            画曲线(开始控制点=(273, 585), 终点控制点=(252, 575), 终点=(237, 586)). \
            画曲线(开始控制点=(228, 591), 终点控制点=(225, 601), 终点=(224, 605)). \
            画曲线(开始控制点=(217, 630), 终点控制点=(201, 690), 终点=(202, 739)). \
            画曲线(开始控制点=(202, 751), 终点控制点=(202, 766), 终点=(213, 777)). \
            画曲线(开始控制点=(225, 788), 终点控制点=(241, 788), 终点=(248, 788))

        return [_右鞋底, _右鞋]

    def 右手臂(self):

        _右手臂色 = self.绘图板.创建线性渐变色(开始位置=(200.54, 412.51), 结束位置=(300.89, 508.76),
                                 开始颜色="#710608", 结束颜色="#f00e12",
                                 开始偏移=0.25, 结束偏移=0.8)
        # _右手臂色 = "#f00e12"  # TODO: 未使用渐变色
        _右手臂 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_右手臂色). \
            移动到(x=243, y=419). \
            画曲线(开始控制点=(269, 409), 终点控制点=(291, 407), 终点=(312, 412)). \
            画曲线(开始控制点=(326, 415), 终点控制点=(346, 424), 终点=(346, 434)). \
            画曲线(开始控制点=(345, 440), 终点控制点=(343, 447), 终点=(332, 454)). \
            画曲线(开始控制点=(323, 459), 终点控制点=(277, 472), 终点=(258, 489)). \
            画曲线(开始控制点=(232, 510), 终点控制点=(243, 522), 终点=(227, 529)). \
            画曲线(开始控制点=(200, 542), 终点控制点=(172, 515), 终点=(174, 489)). \
            画曲线(开始控制点=(175, 471), 终点控制点=(183, 444), 终点=(243, 419))

        _右手套色 = self.绘图板.创建线性渐变色(开始位置=(117.04, 568.7), 结束位置=(284.66, 513.0),
                                 开始颜色="#666767", 结束颜色="#fcfcfc",
                                 开始偏移=0.1, 结束偏移=0.8,
                                 )
        # _右手套色 = "#fcfcfc"  # TODO: 未使用渐变色
        _右手套 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_右手套色). \
            移动到(x=229, y=463). \
            画曲线(开始控制点=(245, 470), 终点控制点=(261, 477), 终点=(269, 493)). \
            画曲线(开始控制点=(274, 504), 终点控制点=(274, 522), 终点=(273, 528)). \
            画曲线(开始控制点=(259, 511), 终点控制点=(248, 507), 终点=(247, 507)). \
            画曲线(开始控制点=(247, 508), 终点控制点=(262, 514), 终点=(273, 528)). \
            画曲线(开始控制点=(283, 541), 终点控制点=(293, 568), 终点=(282, 584)). \
            画曲线(开始控制点=(275, 595), 终点控制点=(262, 598), 终点=(261, 598)). \
            画曲线(开始控制点=(259, 598), 终点控制点=(255, 598), 终点=(250, 597)). \
            画曲线(开始控制点=(241, 595), 终点控制点=(232, 589), 终点=(229, 586)). \
            画曲线(开始控制点=(232, 580), 终点控制点=(237, 577), 终点=(241, 572)). \
            画曲线(开始控制点=(239, 573), 终点控制点=(235, 575), 终点=(230, 583)). \
            画曲线(开始控制点=(223, 594), 终点控制点=(221, 603), 终点=(221, 604)). \
            画曲线(开始控制点=(223, 598), 终点控制点=(223, 597), 终点=(229, 586)). \
            画曲线(开始控制点=(242, 592), 终点控制点=(247, 600), 终点=(260, 598)). \
            画曲线(开始控制点=(256, 603), 终点控制点=(246, 621), 终点=(238, 626)). \
            画曲线(开始控制点=(211, 643), 终点控制点=(162, 636), 终点=(138, 614)). \
            画曲线(开始控制点=(118, 597), 终点控制点=(102, 554), 终点=(114, 525)). \
            画曲线(开始控制点=(122, 505), 终点控制点=(129, 495), 终点=(146, 487)). \
            画曲线(开始控制点=(158, 480), 终点控制点=(175, 487), 终点=(182, 487)). \
            画曲线(开始控制点=(172, 485), 终点控制点=(163, 483), 终点=(149, 485)). \
            画曲线(开始控制点=(149, 468), 终点控制点=(155, 462), 终点=(162, 457)). \
            画曲线(开始控制点=(179, 442), 终点控制点=(216, 458), 终点=(229, 463))

        _手套装饰1色 = self.绘图板.创建径向渐变色(渐变开始中心点=(160.26, 535.49), 渐变半径=25,
                                   开始颜色="#dedfdf", 结束颜色="#6e6f6f",
                                   开始偏移=0.1, 结束偏移=1,
                                   ).缩放(1, 1.06).旋转(旋转角度=2.07, 旋转中心点=(160.26, 535.49)).平移(9, -18)
        # _手套装饰1色 = "#6e6f6f"  # TODO: 未使用渐变色
        _手套装饰1 = self.绘图板.画椭圆(x=160.26, y=535.49, 半径=(21.28, 7.83), 描边颜色=颜色.黑色, 填充颜色=_手套装饰1色).旋转(-69)

        _手套装饰2色 = self.绘图板.创建径向渐变色(渐变开始中心点=(193.7, 548.0), 渐变半径=25,
                                   开始颜色="#dedfdf", 结束颜色="#6e6f6f",
                                   开始偏移=0.1, 结束偏移=1,
                                   ).缩放(1, 1.06).旋转(旋转角度=2.07, 旋转中心点=(193.7, 548.0)).平移(8, -24)
        # _手套装饰2色 = "#6e6f6f"  # TODO: 未使用渐变色
        _手套装饰2 = self.绘图板.画椭圆(x=193.7, y=548.0, 半径=(21.28, 7.83), 描边颜色=颜色.黑色, 填充颜色=_手套装饰2色).旋转(-69)

        return [_右手臂, _右手套, _手套装饰1, _手套装饰2]

    def 头面部(self):

        _面部色 = self.绘图板.创建线性渐变色(开始位置=(256.86, 260.04), 结束位置=(537.56, 304.54),
                                开始颜色="#f19576", 结束颜色="#fffdc9",
                                开始偏移=0.13, 结束偏移=0.9,
                                )
        # _面部色 = "#fbdaad"  # TODO: 未使用渐变色
        _面部 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_面部色, id_="头面部"). \
            移动到(x=413, y=124). \
            画曲线(开始控制点=(430, 127), 终点控制点=(462, 133), 终点=(489, 159)). \
            画曲线(开始控制点=(507, 177), 终点控制点=(514, 197), 终点=(520, 214)). \
            画曲线(开始控制点=(526, 230), 终点控制点=(553, 310), 终点=(511, 381)). \
            画曲线(开始控制点=(501, 398), 终点控制点=(481, 432), 终点=(442, 443)). \
            画曲线(开始控制点=(415, 450), 终点控制点=(392, 442), 终点=(377, 437)). \
            画曲线(开始控制点=(319, 418), 终点控制点=(287, 370), 终点=(276, 350)). \
            画曲线(开始控制点=(269, 332), 终点控制点=(261, 315), 终点=(254, 298)). \
            画曲线(开始控制点=(251, 283), 终点控制点=(246, 254), 终点=(255, 221)). \
            画曲线(开始控制点=(259, 204), 终点控制点=(268, 165), 终点=(304, 140)). \
            画曲线(开始控制点=(344, 112), 终点控制点=(390, 120), 终点=(413, 124))
        return [_面部]

    def 鼻子(self):
        _鼻子色 = self.绘图板.创建径向渐变色(渐变开始中心点=(552.12, 243.92), 渐变半径=78.1,
                                开始颜色="#fffdc9", 结束颜色="#fbdaad",
                                开始偏移=.15, 结束偏移=1)
        # _鼻子色 = "#fbdaad"  # TODO: 未使用渐变色
        鼻子 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_鼻子色, id_="鼻子"). \
            移动到(x=450, y=247). \
            画曲线(开始控制点=(465, 218), 终点控制点=(500, 210), 终点=(513, 209)). \
            画曲线(开始控制点=(525, 208), 终点控制点=(560, 204), 终点=(582, 230)). \
            画曲线(开始控制点=(601, 253), 终点控制点=(608, 298), 终点=(589, 321)). \
            画曲线(开始控制点=(569, 348), 终点控制点=(543, 354), 终点=(524, 354)). \
            画曲线(开始控制点=(516, 354), 终点控制点=(509, 353), 终点=(503, 352)). \
            平滑曲线(终点控制点=(464, 345), 终点=(434, 316))
        return 鼻子

    def 嘴巴(self):

        _嘴巴 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色="#7b0400", id_="嘴巴"). \
            移动到(x=415, y=333). \
            画曲线(开始控制点=(412, 344), 终点控制点=(409, 362), 终点=(411, 384)). \
            画曲线(开始控制点=(413, 400), 终点控制点=(415, 420), 终点=(426, 424)). \
            画曲线(开始控制点=(442, 429), 终点控制点=(466, 392), 终点=(470, 385)). \
            画曲线(开始控制点=(486, 361), 终点控制点=(491, 337), 终点=(493, 322)). \
            画曲线(开始控制点=(486, 346), 终点控制点=(464, 360), 终点=(444, 357)). \
            画曲线(开始控制点=(425, 354), 终点控制点=(416, 335), 终点=(415, 333))
        return _嘴巴

    def 舌头(self):

        _舌头 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色="#cc1d03", id_="舌头"). \
            移动到(x=417, y=382). \
            画曲线(开始控制点=(427, 378), 终点控制点=(461, 399), 终点=(451, 410)). \
            画曲线(开始控制点=(444, 417), 终点控制点=(437, 422), 终点=(432, 423)). \
            画曲线(开始控制点=(419, 426), 终点控制点=(416, 409), 终点=(415, 403)). \
            画曲线(开始控制点=(414, 398), 终点控制点=(411, 385), 终点=(417, 382))

        return _舌头

    def 胡须(self):

        _胡须 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色="#411001", id_="胡须"). \
            移动到(x=464, y=317). \
            画曲线(开始控制点=(457, 318), 终点控制点=(441, 319), 终点=(424, 313)). \
            画曲线(开始控制点=(404, 306), 终点控制点=(392, 292), 终点=(387, 286)). \
            画曲线(开始控制点=(385, 291), 终点控制点=(380, 300), 终点=(381, 313)). \
            画曲线(开始控制点=(384, 338), 终点控制点=(407, 350), 终点=(409, 351)). \
            画曲线(开始控制点=(408, 355), 终点控制点=(407, 364), 终点=(413, 372)). \
            画曲线(开始控制点=(421, 384), 终点控制点=(442, 388), 终点=(461, 379)). \
            画曲线(开始控制点=(462, 380), 终点控制点=(470, 390), 终点=(483, 388)). \
            画曲线(开始控制点=(493, 388), 终点控制点=(502, 381), 终点=(506, 371)). \
            画曲线(开始控制点=(511, 373), 终点控制点=(520, 374), 终点=(529, 372)). \
            画曲线(开始控制点=(540, 370), 终点控制点=(547, 365), 终点=(559, 355)). \
            画曲线(开始控制点=(575, 342), 终点控制点=(583, 335), 终点=(582, 331)). \
            画曲线(开始控制点=(581, 323), 终点控制点=(556, 316), 终点=(464, 317))
        return _胡须

    def 右眼(self):

        _右蓝瞳孔 = self.绘图板.画椭圆(x=420.61, y=236.9, 半径=(18.93, 32.57), 描边颜色=颜色.透明, 填充颜色="#50dce9").旋转(-14)

        _右黑眼珠 = self.绘图板.画椭圆(x=421.42, y=236.97, 半径=(16.27, 28.19), 描边颜色=颜色.透明, 填充颜色=颜色.黑色).旋转(-14)

        _右眼白光 = self.绘图板.画椭圆(x=418.04, y=222.96, 半径=(3.53, 4.3), 描边颜色=颜色.透明, 填充颜色=颜色.白色).旋转(-14)

        _右眼蓝光 = self.绘图板.画椭圆(x=422.55, y=245.65, 半径=(2.98, 3.5), 描边颜色=颜色.透明, 填充颜色="#0a0096").旋转(-14)

        return [_右蓝瞳孔, _右黑眼珠, _右眼白光, _右眼蓝光]

    def 左眼(self):

        _左蓝瞳孔 = self.绘图板.画椭圆(x=492.67, y=214.9, 半径=(17.25, 29.68), 描边颜色=颜色.透明, 填充颜色="#50dce9").旋转(-14)

        _左黑眼珠 = self.绘图板.画椭圆(x=493.41, y=214.96, 半径=(14.83, 25.69), 描边颜色=颜色.透明, 填充颜色=颜色.黑色).旋转(-14)

        _左眼白光 = self.绘图板.画椭圆(x=490.33, y=202.19, 半径=(3.21, 3.92), 描边颜色=颜色.透明, 填充颜色=颜色.白色).旋转(-14)

        _左眼蓝光 = self.绘图板.画椭圆(x=494.44, y=222.87, 半径=(2.71, 3.19), 描边颜色=颜色.透明, 填充颜色="#0a0096").旋转(-14)

        return [_左蓝瞳孔, _左黑眼珠, _左眼白光, _左眼蓝光]

    def 头发(self):

        _侧边发 = self.绘图板.路径(描边颜色=颜色.透明, 填充颜色="#411001", id_="头发"). \
            移动到(x=289, y=198). \
            画曲线(开始控制点=(339, 201), 终点控制点=(365, 197), 终点=(367, 203)). \
            画曲线(开始控制点=(370, 212), 终点控制点=(312, 230), 终点=(314, 253)). \
            画曲线(开始控制点=(314, 260), 终点控制点=(321, 269), 终点=(329, 274)). \
            画曲线(开始控制点=(339, 280), 终点控制点=(347, 278), 终点=(351, 284)). \
            画曲线(开始控制点=(353, 289), 终点控制点=(351, 295), 终点=(349, 299)). \
            画曲线(开始控制点=(345, 304), 终点控制点=(338, 307), 终点=(330, 306)). \
            画曲线(开始控制点=(331, 306), 终点控制点=(338, 315), 终点=(334, 321)). \
            画曲线(开始控制点=(331, 327), 终点控制点=(316, 324), 终点=(315, 324)). \
            画曲线(开始控制点=(300, 321), 终点控制点=(291, 278), 终点=(268, 268)). \
            画曲线(开始控制点=(264, 266), 终点控制点=(259, 265), 终点=(250, 266)). \
            画曲线(开始控制点=(250, 256), 终点控制点=(250, 242), 终点=(253, 228)). \
            画曲线(开始控制点=(256, 215), 终点控制点=(259, 205), 终点=(262, 196)). \
            画曲线(开始控制点=(268, 197), 终点控制点=(278, 198), 终点=(289, 198))

        三毛 = self.绘图板.路径(描边颜色="#411001", 描边宽度=3, id_="三毛"). \
            移动到(x=366.43, y=140.64). \
            画曲线(开始控制点=(366.77, 139.43), 终点控制点=(373.9, 112.2), 终点=(355.2, 93.15)). \
            画曲线(开始控制点=(342.83, 80.55), 终点控制点=(327.0, 79.51), 终点=(323.03, 79.36)). \
            移动到(x=393.46, y=132.16). \
            画曲线(开始控制点=(394.48, 130.31), 终点控制点=(406.73, 107.21), 终点=(394.48, 83.65)). \
            画曲线(开始控制点=(384.48, 64.42), 终点控制点=(365.5, 58.98), 终点=(362.31, 58.12)). \
            移动到(x=422.36, y=134.2). \
            画曲线(开始控制点=(425.24, 128.45), 终点控制点=(431.22, 114.58), 终点=(429.51, 96.41)). \
            画曲线(开始控制点=(427.47, 74.73), 终点控制点=(415.78, 60.64), 终点=(411.64, 56.07))

        return [_侧边发, 三毛]

    def 帽子(self):

        _帽檐内部 = self.绘图板.路径(描边颜色=颜色.透明, 填充颜色="#550000"). \
            移动到(x=489, y=159). \
            画曲线(开始控制点=(502, 152), 终点控制点=(517, 142), 终点=(541, 137)). \
            画曲线(开始控制点=(563, 133), 终点控制点=(591, 132), 终点=(598, 137)). \
            画曲线(开始控制点=(598, 146), 终点控制点=(586, 155), 终点=(571, 165)). \
            画曲线(开始控制点=(565, 168), 终点控制点=(557, 174), 终点=(544, 178)). \
            画曲线(开始控制点=(529, 183), 终点控制点=(516, 183), 终点=(507, 183)). \
            画曲线(开始控制点=(501, 174), 终点控制点=(498, 168), 终点=(489, 159))

        _帽顶色 = self.绘图板.创建线性渐变色(开始位置=(263.28, 199.96), 结束位置=(446.33, 48.62),
                                开始颜色="#8a0005", 结束颜色="#ff0f13",
                                开始偏移=0, 结束偏移=0.82)
        # _帽顶色 = "#ff0f13"  # TODO: 未使用渐变色
        _帽顶 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_帽顶色). \
            移动到(x=232, y=338). \
            画曲线(开始控制点=(230, 338), 终点控制点=(184, 331), 终点=(170, 295)). \
            画曲线(开始控制点=(163, 280), 终点控制点=(165, 265), 终点=(166, 260)). \
            画曲线(开始控制点=(167, 254), 终点控制点=(170, 234), 终点=(187, 219)). \
            画曲线(开始控制点=(200, 209), 终点控制点=(213, 206), 终点=(219, 205)). \
            画曲线(开始控制点=(226, 173), 终点控制点=(244, 110), 终点=(298, 60)). \
            画曲线(开始控制点=(318, 41), 终点控制点=(352, 11), 终点=(400, 10)). \
            画曲线(开始控制点=(413, 10), 终点控制点=(450, 9), 终点=(477, 38)). \
            画曲线(开始控制点=(503, 67), 终点控制点=(499, 104), 终点=(498, 111)). \
            画曲线(开始控制点=(474, 115), 终点控制点=(441, 124), 终点=(404, 142)). \
            画曲线(开始控制点=(384, 152), 终点控制点=(360, 164), 终点=(333, 187)). \
            画曲线(开始控制点=(299, 216), 终点控制点=(280, 247), 终点=(264, 274)). \
            画曲线(开始控制点=(249, 299), 终点控制点=(239, 322), 终点=(232, 338))

        _帽徽色 = self.绘图板.创建径向渐变色(渐变开始中心点=(429.6, 95.34), 渐变半径=48.67,
                                开始颜色="#f3f3f3", 结束颜色="#bbbbbb",
                                开始偏移=0.75, 结束偏移=1)
        # _帽徽色 = "#f3f3f3"  # TODO: 未使用渐变色
        _帽徽 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_帽徽色). \
            移动到(x=395, y=145). \
            画曲线(开始控制点=(394, 144), 终点控制点=(371, 127), 终点=(373, 99)). \
            画曲线(开始控制点=(375, 77), 终点控制点=(392, 58), 终点=(413, 53)). \
            画曲线(开始控制点=(432, 49), 终点控制点=(452, 56), 终点=(464, 71)). \
            画曲线(开始控制点=(480, 91), 终点控制点=(474, 115), 终点=(474, 117)). \
            画曲线(开始控制点=(447, 126), 终点控制点=(421, 135), 终点=(395, 145))

        _帽徽M = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色="#f92413"). \
            移动到(x=417, y=92). \
            画曲线(开始控制点=(417, 96), 终点控制点=(417, 102), 终点=(418, 110)). \
            画曲线(开始控制点=(419, 112), 终点控制点=(419, 115), 终点=(419, 118)). \
            画曲线(开始控制点=(420, 121), 终点控制点=(418, 123), 终点=(416, 124)). \
            画曲线(开始控制点=(415, 125), 终点控制点=(413, 125), 终点=(412, 124)). \
            画曲线(开始控制点=(411, 123), 终点控制点=(410, 122), 终点=(410, 121)). \
            画曲线(开始控制点=(408, 118), 终点控制点=(408, 113), 终点=(407, 107)). \
            画曲线(开始控制点=(407, 99), 终点控制点=(407, 94), 终点=(407, 93)). \
            画曲线(开始控制点=(406, 89), 终点控制点=(406, 86), 终点=(405, 82)). \
            画曲线(开始控制点=(404, 77), 终点控制点=(404, 74), 终点=(405, 72)). \
            画曲线(开始控制点=(406, 70), 终点控制点=(407, 68), 终点=(409, 68)). \
            画曲线(开始控制点=(411, 67), 终点控制点=(412, 68), 终点=(414, 69)). \
            画曲线(开始控制点=(416, 71), 终点控制点=(418, 75), 终点=(421, 80)). \
            画曲线(开始控制点=(424, 86), 终点控制点=(428, 91), 终点=(432, 97)). \
            画曲线(开始控制点=(432, 90), 终点控制点=(432, 82), 终点=(431, 73)). \
            画直线(终点x=431, 终点y=65). \
            画曲线(开始控制点=(431, 61), 终点控制点=(432, 59), 终点=(434, 58)). \
            画曲线(开始控制点=(437, 57), 终点控制点=(439, 59), 终点=(442, 62)). \
            画曲线(开始控制点=(443, 63), 终点控制点=(444, 66), 终点=(446, 70)). \
            画曲线(开始控制点=(451, 79), 终点控制点=(455, 86), 终点=(460, 92)). \
            画曲线(开始控制点=(464, 98), 终点控制点=(466, 102), 终点=(466, 102)). \
            画曲线(开始控制点=(467, 104), 终点控制点=(467, 105), 终点=(466, 106)). \
            画曲线(开始控制点=(465, 107), 终点控制点=(464, 108), 终点=(463, 108)). \
            画曲线(开始控制点=(461, 109), 终点控制点=(458, 108), 终点=(456, 105)). \
            画直线(终点x=451, 终点y=98). \
            画曲线(开始控制点=(449, 94), 终点控制点=(446, 89), 终点=(442, 82)). \
            画曲线(开始控制点=(442, 85), 终点控制点=(442, 90), 终点=(442, 98)). \
            画直线(终点x=442, 终点y=104). \
            画曲线(开始控制点=(442, 107), 终点控制点=(442, 109), 终点=(441, 111)). \
            画曲线(开始控制点=(441, 114), 终点控制点=(440, 115), 终点=(438, 116)). \
            画曲线(开始控制点=(435, 117), 终点控制点=(433, 116), 终点=(431, 114)). \
            画直线(终点x=427, 终点y=108). \
            画曲线(开始控制点=(424, 103), 终点控制点=(420, 98), 终点=(417, 92))

        _帽檐色 = self.绘图板.创建线性渐变色(开始位置=(335.53, 268.91), 结束位置=(561.12, 82.38),
                                开始颜色="#910106", 结束颜色="#ff0f13",
                                开始偏移=0.2, 结束偏移=0.8,
                                )
        # _帽檐色 = "#ff0f13"  # TODO: 未使用渐变色
        _帽檐 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_帽檐色). \
            移动到(x=531, y=141). \
            画曲线(开始控制点=(520, 144), 终点控制点=(511, 148), 终点=(508, 150)). \
            画曲线(开始控制点=(435, 184), 终点控制点=(416, 194), 终点=(416, 194)). \
            平滑曲线(终点控制点=(363, 224), 终点=(333, 228)). \
            画曲线(开始控制点=(312, 232), 终点控制点=(310, 226), 终点=(298, 223)). \
            画曲线(开始控制点=(316, 202), 终点控制点=(343, 172), 终点=(384, 149)). \
            画曲线(开始控制点=(431, 122), 终点控制点=(473, 112), 终点=(496, 109)). \
            画曲线(开始控制点=(507, 108), 终点控制点=(516, 108), 终点=(525, 107)). \
            画曲线(开始控制点=(535, 107), 终点控制点=(544, 107), 终点=(556, 108)). \
            画曲线(开始控制点=(575, 111), 终点控制点=(586, 113), 终点=(594, 122)). \
            画曲线(开始控制点=(600, 129), 终点控制点=(598, 134), 终点=(597, 139)). \
            画曲线(开始控制点=(595, 138), 终点控制点=(593, 137), 终点=(590, 137)). \
            画曲线(开始控制点=(587, 136), 终点控制点=(578, 134), 终点=(557, 136)). \
            画曲线(开始控制点=(550, 137), 终点控制点=(542, 138), 终点=(531, 141))
        return [_帽檐内部, _帽顶, _帽徽, _帽徽M, _帽檐]

    def 耳朵(self):

        _耳朵色 = self.绘图板.创建线性渐变色(开始位置=(197.59, 362.59), 结束位置=(289.97, 316.76),
                                开始颜色="#ffd2a3", 结束颜色="#f39676",
                                开始偏移=0.58, 结束偏移=0.83,
                                )
        # _耳朵色 = "#fbdaad"  # TODO: 未使用渐变色
        _耳朵 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_耳朵色). \
            移动到(x=305, y=377). \
            画曲线(开始控制点=(302, 381), 终点控制点=(284, 401), 终点=(256, 401)). \
            画曲线(开始控制点=(225, 401), 终点控制点=(197, 376), 终点=(192, 346)). \
            画曲线(开始控制点=(186, 303), 终点控制点=(200, 285), 终点=(224, 276)). \
            画曲线(开始控制点=(245, 269), 终点控制点=(267, 276), 终点=(270, 277))

        _耳内色 = self.绘图板.创建径向渐变色(渐变开始中心点=(257.64, 335.45), 渐变半径=45.0,
                                开始颜色="#ffd2a3", 结束颜色="#a9714d",
                                开始偏移=0.55, 结束偏移=0.8,
                                渐变的焦点=(222.93, 335.45),
                                # 缩放=(1, 1.88), 平移=(0, -296.12)
                                ).缩放(1, 1).平移(-5, 0)

        # _耳内色 = "#fbdaad"  # TODO: 未使用渐变色
        _耳内 = self.绘图板.路径(描边颜色=颜色.黑色, 填充颜色=_耳内色). \
            移动到(x=236, y=308). \
            画曲线(开始控制点=(259, 306), 终点控制点=(266, 318), 终点=(271, 323)). \
            画曲线(开始控制点=(257, 327), 终点控制点=(254, 329), 终点=(254, 329)). \
            画曲线(开始控制点=(254, 329), 终点控制点=(267, 322), 终点=(274, 327)). \
            画曲线(开始控制点=(279, 331), 终点控制点=(281, 342), 终点=(277, 350)). \
            画曲线(开始控制点=(273, 359), 终点控制点=(260, 365), 终点=(245, 362))
        return [_耳朵, _耳内]

    def 眉毛(self):

        _右眉毛 = self.绘图板.路径(描边颜色=颜色.透明, 填充颜色="#411001", id_="右眉毛"). \
            移动到(x=373, y=196). \
            画曲线(开始控制点=(371, 195), 终点控制点=(373, 158), 终点=(390, 151)). \
            画曲线(开始控制点=(401, 146), 终点控制点=(414, 158), 终点=(421, 168)). \
            画曲线(开始控制点=(413, 164), 终点控制点=(406, 161), 终点=(397, 166)). \
            画曲线(开始控制点=(384, 172), 终点控制点=(374, 196), 终点=(373, 196))

        _左眉毛 = self.绘图板.路径(描边颜色=颜色.透明, 填充颜色="#411001", id_="左眉毛"). \
            移动到(x=454, y=162). \
            画曲线(开始控制点=(452, 161), 终点控制点=(447, 143), 终点=(460, 141)). \
            画曲线(开始控制点=(472, 139), 终点控制点=(484, 152), 终点=(489, 158)). \
            画曲线(开始控制点=(484, 153), 终点控制点=(481, 148), 终点=(470, 148)). \
            画曲线(开始控制点=(454, 148), 终点控制点=(454, 162), 终点=(454, 162))
        return [_右眉毛, _左眉毛]

    def 元素列表(self):
        身体元素 = [
            self.左鞋(),
            self.左手臂(),
            self.上身(),
            self.右鞋(),
            self.右手臂(),
        ]
        身体 = self.绘图板.创建组合(元素列表=身体元素, id_="身体")  # .立体阴影(灯光位置=(700, 0, 100))
        面部元素 = [
            self.头面部(),
            self.嘴巴(),
            self.舌头(),
            self.胡须(),

            self.左眼(),
            self.右眼(),

            self.鼻子(),

            self.眉毛(),
            self.头发(),
        ]
        面部 = self.绘图板.创建组合(元素列表=面部元素, id_="面部")  # .立体阴影(灯光位置=(700, 0, 100))

        显示帽子 = self.获取参数("显示帽子", False)

        if 显示帽子:
            帽子 = self.绘图板.创建组合(元素列表=self.帽子(), id_="帽子")  # .立体阴影(灯光位置=(700, 0, 100))

        耳朵 = self.绘图板.创建组合(元素列表=self.耳朵(), id_="耳朵")

        超级玛丽元素 = [
            身体,
            面部,
        ]
        if 显示帽子:
            超级玛丽元素.append(帽子)

        超级玛丽元素.append(耳朵)
        return 超级玛丽元素
