# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手工.几何体展开图 import 几何体展开图
from 神笔码靓.神笔库.PDF工具集 import *
from 神笔码靓.神笔库.形状工具集 import 多边形工具


class 六面体展开图(几何体展开图):

    def 构建顶点(self):
        顶点号列表 = [
            (1, 2, 4, 3),  # 正方形
            (3, 4, 6, 5),  # 正方形
            (5, 6, 8, 7),  # 正方形
            (7, 8, 10, 9),  # 正方形
            (3, 5, 11, 12),  # 正方形
            (6, 4, 13, 14)  # 正方形
        ]
        self.顶点号构建(顶点号列表)

    def 构建粘贴线(self):
        粘贴线基础点列表 = [
            (10, 9), (4, 13), (13, 14),
            (14, 6), (5, 11), (11, 12),
            (12, 3)
        ]
        self.顶点号构建粘贴线(粘贴线基础点列表)

    def 页面设置(self, 设置: 纸张设置):
        # 输出 PDF 文件，以及 页面打印，在这里设置好
        设置.上页边距 = "0cm"
        设置.下页边距 = "0"
        设置.左页边距 = "0.1cm"
        设置.右页边距 = "0"
        设置.页面方向 = 纸张方向.纵向
        设置.页面尺寸规格 = "A4"
        设置.页面缩放 = 1.0

    def 初始顶点(self):
        顶点1 = (self.宽 / 2.9, self.高 / 1.1)
        顶点2 = 多边形工具.找点(顶点1, 角度=0, 距离=self.宽 / 3.3)

        return 顶点1, 顶点2

    def 创作(self):
        self.构建顶点()
        self.构建粘贴线()


if __name__ == '__main__':
    四面体 = 六面体展开图(作品文件路径="六面体展开图.svg", 页面大小=纸张大小.A4_纵向(), 显示标签=否)
    四面体.完成()
    四面体.生成PDF()
