# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.手工.几何体展开图 import 几何体展开图
from 神笔码靓.神笔库.PDF工具集 import *
from 神笔码靓.神笔库.形状工具集 import 多边形工具


class 十二面体展开图(几何体展开图):

    def 构建顶点(self):
        顶点号列表 = [
            (1, 2, 3, 4, 5),  # 五边形
            (4, 3, 6, 7, 8),  # 五边形
            (3, 2, 9, 10, 11),  # 五边形
            (7, 6, 12, 13, 14),  # 五边形
            (10, 9, 15, 16, 17),  # 五边形
            (2, 1, 18, 19, 20),  # 五边形
            (19, 18, 21, 22, 23),  # 五边形
            (1, 5, 24, 25, 26),  # 五边形
            (25, 24, 27, 28, 29),  # 五边形
            (5, 4, 30, 31, 32),  # 五边形
            (31, 30, 33, 34, 35),  # 五边形
            (35, 34, 36, 37, 38),  # 五边形
        ]
        self.顶点号构建(顶点号列表)

    def 构建粘贴线(self):
        粘贴线基础点列表 = [
            (1, 18), (18, 21), (21, 22), (22, 23),
            (5, 24), (24, 27), (27, 28), (28, 29),
            (3, 6), (6, 12), (12, 13), (13, 14), (14, 7), (7, 8),
            (8, 4), (2, 9), (9, 15), (15, 16), (16, 17)
        ]
        self.顶点号构建粘贴线(粘贴线基础点列表, 距离=35)

    def 页面设置(self, 设置: 纸张设置):
        # 输出 PDF 文件，以及 页面打印，在这里设置好
        设置.上页边距 = "0cm"
        设置.下页边距 = "0"
        设置.左页边距 = "0.1cm"
        设置.右页边距 = "0"
        设置.页面方向 = 纸张方向.纵向
        设置.页面尺寸规格 = "A4"
        设置.页面缩放 = 1.0

    def 初始顶点(self):
        顶点1 = (self.宽 / 2.2, self.高 / 1.7)
        顶点2 = 多边形工具.找点(顶点1, 角度=0, 距离=self.宽 / 6.8)

        return 顶点1, 顶点2

    def 创作(self):
        self.构建顶点()
        self.构建粘贴线()


if __name__ == '__main__':
    四面体 = 十二面体展开图(作品文件路径="十二面体展开图.svg", 页面大小=纸张大小.A4_纵向(), 显示标签=否)
    四面体.完成()
    四面体.生成PDF()
