# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.线条工具集 import *

if __name__ == '__main__':
    宽, 高 = 纸张大小.A4_纵向(1)
    神笔 = 神笔绘图板(作品文件路径="圆形印章测试.svg", 宽=宽, 高=高)
    圆形印章模板 = 神笔.神笔模板("圆形印章", 圆心点=(100, 100), 颜色=颜色.红色,
                     主文字="Python超人科技有限公司", 主文字字体=系统字体.华文新魏, 主文字间距=-0.5,
                     抬头文字="办公专用", 抬头文字字体=系统字体.华文新魏, 抬头文字大小=11, 抬头文字上下微调=-2, 抬头文字间距=-1,
                     副文字="93503454824", 副文字大小=9, 副文字间距=0
                     )
    圆形印章模板.创造元素(x=0, y=0, id_="圆形印章").缩放(5)
    神笔.完成()
    神笔.生成PNG(PNG生成方式.谷歌浏览器)
