# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


class 梦幻彩虹漩涡(神笔绘图板):

    def 图形(self, 缩放, 彩虹渐变色):
        pass

    def 创作(self):
        # self.显示图框()

        彩虹渐变色 = self.创建彩虹线性渐变色(开始位置=(0, 0), 结束位置=(self.宽, self.高))

        缩放比 = 0.9
        旋转角度 = self.旋转角度
        for i in range(100):
            缩放 = 幂运算(缩放比, i)
            矩形 = self.图形(缩放, 彩虹渐变色)
            if 旋转角度 != 0:
                矩形.旋转(i * 旋转角度)


if __name__ == '__main__':
    # 作品文件路径：保存的 SVG（矢量图）格式的文件路径名称
    # 宽: 神笔绘图板也需要设置页面的宽度
    # 高: 神笔绘图板也需要设置页面的高度
    宽, 高 = 纸张大小.A4_横向(1)
    # for 角度 in range(3,91) :
    for 角度 in [3, 6, 10, 15, 30, 45, 90, 180]:
        神笔 = 梦幻彩虹漩涡(作品文件路径=f"梦幻矩形\梦幻矩形_角度{角度}.svg", 宽=宽, 高=高)
        神笔.旋转角度 = 角度
        神笔.完成()
