# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-07-23
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库 import 五角星绘画路径, 五角星路径
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


class 平面立体画制作(神笔绘图板):
    """
    将图像进行变形，平铺在桌面或者地板上，可以看到的立体画
    """

    def __init__(self, 文件路径):
        宽, 高 = 纸张大小.A4_纵向(1)
        super(平面立体画制作, self).__init__(作品文件路径=文件路径, 宽=宽, 高=宽)

    def 创作(self):
        self.显示图框()
        # self.显示网格()

        SVG图片 = 资源库目录("素材/斗兽棋/象.svg")

        font_file = r"C:\Windows\Fonts\STSONG.TTF"
        # font_file = r"C:\Windows\Fonts\simhei.ttf"
        # font_file = r"C:\Windows\Fonts\FZYTK.TTF"
        # font_file = 字体文件目录("小篆体.ttf")
        font_file = 字体文件目录("甲骨文.ttf")

        self.文字转路径(x=200, y=200, 文字="国家\n你好", 字体文件=font_file, 字体大小=100, 字符间距="10%",
                   # 垂直基线对齐=文字垂直基线对齐.中线对齐, 水平基线对齐=文字水平基线对齐.中点对齐
                   # 垂直基线对齐=文字垂直基线对齐.顶线对齐, 水平基线对齐=文字水平基线对齐.起始点对齐
                   # 垂直基线对齐=文字垂直基线对齐.底线对齐, 水平基线对齐=文字水平基线对齐.结束点对齐
                   ).描边宽度(0.1)  # .填充颜色(颜色.红色).阴影()

        # self.导入SVG为模板(x=0, y=0, SVG图片=作品输出目录("无限高清超级玛丽.svg")).创造元素(0,0)
        # self.导入SVG为模板(x=0, y=0, SVG图片=作品输出目录("斗兽棋.svg")).创造元素(0,300)

        #     self.斗兽棋图标模板[动物名] = 动物贴图 # self.创建模板(id_=动物名, 元素列表=[动物贴图])
        #
        # size = 2000
        # path1 = 五角星绘画路径(x=size, y=size, 半径大小=size, 旋转角度=0)
        # path2 = 五角星路径(x=size, y=size, 半径大小=size, 旋转角度=0)
        #
        # self.连线(path1, 描边宽度=0.1, 描边颜色=颜色.红色)
        # self.连线(path2, 描边宽度=0.1, 描边颜色=颜色.绿色)
        # self.画正三边形(100, 100, 100)
        # self.画正四边形(100, 100, 100)
        # self.画正五边形(100, 100, 100)
        # self.画正六边形(100, 100, 100)
        # self.画正方形(100, 100, 100)
        # self.写字(x=self.宽 / 2, y=self.高 / 2 - 50, 文字="你好啊", 字体大小=150)
        # self.写字(x=self.宽 / 3, y=self.高 / 2, 文字="你好啊!", 字体大小=200).倾斜X(20).倾斜Y(20)


if __name__ == '__main__':
    神笔 = 平面立体画制作(文件路径="平面立体画制作.svg")
    神笔.完成()
    神笔.生成PDF()
