# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.线条工具集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *

if __name__ == '__main__':
    # https://www.emojiall.com/zh-hans/node/72
    麻将牌 = """
万字牌：
🀇
麻将牌一万
🀈
麻将牌两万
🀉
麻将牌三万
🀊
麻将牌四万
🀋
麻将牌五万
🀌
麻将牌六万
🀍
麻将牌七万
🀎
麻将牌八万
🀏
麻将牌九万
条（索）子牌：
🀐
麻将牌幺鸡
🀑
麻将牌两条
🀒
麻将牌三条
🀓
麻将牌四条
🀔
麻将牌五条
🀕
麻将牌六条
🀖
麻将牌七条
🀗
麻将牌八条
🀘
麻将牌九条
筒（饼）子牌：
🀙
麻将牌一筒
🀚
麻将牌两筒
🀛
麻将牌三筒
🀜
麻将牌四筒
🀝
麻将牌五筒
🀞
麻将牌六筒
🀟
麻将牌七筒
🀠
麻将牌八筒
🀡
麻将牌九筒
字牌：
🀀
麻将牌东风
🀁
麻将牌南风
🀂
麻将牌西风
🀃
麻将牌北风
🀄
红中
🀅
麻将牌发财
🀆
麻将牌白板
花牌：
🀢
麻将牌梅
🀣
麻将牌兰
🀤
麻将牌竹
🀥
麻将牌菊
🀦
麻将牌春
🀧
麻将牌夏
🀨
麻将牌秋
🀩
麻将牌冬
其他
🀪
麻将牌百搭
🀫
麻将牌背面 
"""
    麻将牌 = "🀙🀚🀛🀜🀝🀞🀟🀠🀡🀇🀈🀉🀊🀋🀌🀍🀎🀏🀐🀑🀒🀓🀔🀕🀖🀗🀘🀙🀚🀛🀜🀝🀞🀟🀠🀡🀢🀣🀥🀤🀦🀧🀨🀩🀪🀀🀁🀂🀃🀆🀅🀄🀫"  # 🀇🀄️🀀︎🀀
    麻将牌 = "🀇🀈🀉🀊🀋🀌🀍🀎🀏🀐🀑🀒🀓🀔🀕🀖🀗🀘🀙🀚🀛🀜🀝🀞🀟🀠🀡🀀🀁🀂🀃🀄🀅🀆  🀢🀣🀤🀥🀦🀧🀨🀩 🀪🀫"
    神笔 = 神笔绘图板(作品文件路径="麻将牌.svg", 高=220, 宽=160)
    神笔.显示图框()
    # 神笔.显示网格(网格线距=5, 网格字体大小=5, 线条样式="1,1")
    for i in range(0, len(麻将牌), 9):
        神笔.写字(x=0, y=10+i * 4, 文字=麻将牌[i:i + 9], 水平基线对齐=文字水平基线对齐.起始点对齐, 垂直基线对齐=文字垂直基线对齐.顶线对齐)
    神笔.完成()
    神笔.生成PDF()
