from 神笔码靓.神笔库 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.通用工具集 import *

屏幕宽, 屏幕高 = 屏幕分辨率.我的手机()
绘图板 = 神笔绘图板("手机壁纸_电视信号测试图", 宽=屏幕宽, 高=屏幕高)


def 创建帧网格():
    帧网格开始位置X, 帧网格开始位置Y = 90, 1150
    帧网格宽度, 帧网格高度 = 75, 37.5
    帧网格描边宽度 = 6
    for 索引值 in 范围(13):
        帧网格位置X = 帧网格开始位置X + (索引值 - 0.5) * 帧网格宽度
        上方帧网格位置Y = 帧网格开始位置Y
        下方帧网格位置Y = 帧网格开始位置Y + 帧网格高度
        上方帧网格 = 绘图板.画矩形(x=帧网格位置X, y=上方帧网格位置Y, 宽=帧网格宽度, 高=帧网格高度,
                        描边颜色=颜色.白色, 描边宽度=帧网格描边宽度, 填充颜色=颜色.黑色)
        下方帧网格 = 绘图板.画矩形(x=帧网格位置X, y=下方帧网格位置Y, 宽=帧网格宽度, 高=帧网格高度,
                        描边颜色=颜色.白色, 描边宽度=帧网格描边宽度, 填充颜色=颜色.黑色)


def 创建彩色条():
    彩色条开始位置X, 彩色条开始位置Y = 90, 998
    彩色条宽度, 彩色条高度 = 150, 150
    彩色条颜色集 = ["#F6FF0B", "#13FFF5", "#10FF08", "#E500ED", 颜色.红色, 颜色.蓝色]
    for 索引值, 彩条颜色 in 索引列举(彩色条颜色集):
        彩条位置X = 彩色条开始位置X + 索引值 * 彩色条宽度
        彩条位置Y = 彩色条开始位置Y
        彩色条 = 绘图板.画矩形(x=彩条位置X, y=彩条位置Y, 宽=彩色条宽度, 高=彩色条高度,
                      填充颜色=彩条颜色, 描边宽度=0)


def 创建清晰度条():
    清晰度条宽度, 清晰度条高度 = 9, 147
    清晰度条开始位置X, 清晰度条开始位置Y = 198, 1228
    清晰度条往右偏移 = 0
    清晰度条结束位置Y = 清晰度条开始位置Y + 清晰度条高度

    for 索引值 in 范围(90):
        清晰度条位置X = 清晰度条开始位置X + 清晰度条往右偏移
        清晰度条往右偏移 += 清晰度条宽度 * 2.18
        清晰度条宽度 = 清晰度条宽度 / 1.0256
        清晰度条 = 绘图板.连直线(路径点列表=[
            (清晰度条位置X, 清晰度条开始位置Y),
            (清晰度条位置X, 清晰度条结束位置Y)
        ], 描边宽度=清晰度条宽度, 描边颜色=颜色.黑色)


def 创建黑白条():

    黑白参考累计X = 黑白参考开始X
    for 索引值 in 范围(16):
        if 索引值 == 0:
            填充颜色 = 颜色.黑色
            宽倍数 = 2

        elif 索引值 == 15:
            填充颜色 = "#BEBDC2"
            宽倍数 = 2
        else:
            宽倍数 = 1
            填充颜色 = 颜色.黑色 if 索引值 % 2 == 0 else "#BEBDC2"
        if 索引值 > 1:
            黑白参考累计X += 黑白参考宽度
        elif 索引值 == 1:
            黑白参考累计X += 黑白参考宽度 * 2
        彩条黑白参考 = 绘图板.画矩形(黑白参考累计X, 黑白参考开始Y,
                         宽=黑白参考宽度 * 宽倍数, 高=黑白参考高度, 填充颜色=填充颜色,
                         描边颜色=颜色.白色, 描边宽度=0).添加到列表(元素列表_)

创建帧网格()
创建彩色条()
创建清晰度条()

绘图板.完成()