# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.数学.梦幻彩虹漩涡 import 梦幻彩虹漩涡
from 神笔码靓.神笔库 import 样式工具集
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *
import math

if __name__ == '__main__':
    比例缩小 = 1 / ((1 + math.sqrt(5)) / 2)
    宽, 高 = 纸张大小.A4_横向()
    print(比例缩小)
    边长 = 宽 / 2.2
    描边宽度比率 = 0.002
    神笔 = 神笔绘图板("正方形黄金分割.svg", 宽=宽, 高=高)
    神笔.显示图框()
    颜色集 = 样式工具集.彩虹色2[:6]
    颜色索引 = 0


    def 获取颜色():
        global 颜色索引
        if 颜色索引 >= 返回长度(颜色集):
            颜色索引 = 0
        颜色 = 颜色集[颜色索引]
        颜色索引 += 1
        return 颜色


    id_no = 0
    x = 宽 / 2 - 边长 + (宽 / 14)
    y = 高 / 2 - 边长 / 2
    描边宽度 = 0  # 边长*描边宽度比率
    神笔.画矩形(x=x, y=y, 宽=边长, 高=边长, 描边宽度=描边宽度, 填充颜色=获取颜色(), id_=f"rect_0_1")

    for i in range(20):
        x = x + 边长
        边长 = 边长 * 比例缩小
        神笔.画矩形(x=x, y=y, 宽=边长, 高=边长, 描边宽度=描边宽度, 填充颜色=获取颜色(), id_=f"rect_{i}_2")

        x = x + 边长
        y = y + 边长
        边长 = 边长 * 比例缩小
        x = x - 边长
        神笔.画矩形(x=x, y=y, 宽=边长, 高=边长, 描边宽度=描边宽度, 填充颜色=获取颜色(), id_=f"rect_{i}_3")

        y = y + 边长
        边长 = 边长 * 比例缩小
        x = x - 边长
        y = y - 边长
        神笔.画矩形(x=x, y=y, 宽=边长, 高=边长, 描边宽度=描边宽度, 填充颜色=获取颜色(), id_=f"rect_{i}_4")

        边长 = 边长 * 比例缩小
        y = y - 边长
        神笔.画矩形(x=x, y=y, 宽=边长, 高=边长, 描边宽度=描边宽度, 填充颜色=获取颜色(), id_=f"rect_{i + 1}_1")

        描边宽度 = 0  # 边长 * 描边宽度比率

    神笔.完成()
