# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-06-01
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.数学.梦幻彩虹漩涡 import 梦幻彩虹漩涡
from 神笔码靓.神笔库.神笔绘图板 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *


class 矩形梦幻彩虹漩涡(梦幻彩虹漩涡):

    def 图形(self, 缩放, 彩虹渐变色):
        宽 = self.宽 * 缩放
        高 = self.高 * 缩放
        描边宽度 = 6 * 缩放
        x, y = (self.宽 - 宽) / 2, (self.高 - 高) / 2

        return self.画矩形(x=x, y=y, 宽=宽, 高=高, 描边颜色=颜色.白色, 描边宽度=描边宽度, 填充颜色=彩虹渐变色)


if __name__ == '__main__':
    # 作品文件路径：保存的 SVG（矢量图）格式的文件路径名称
    # 宽: 神笔绘图板也需要设置页面的宽度
    # 高: 神笔绘图板也需要设置页面的高度
    宽, 高 = 纸张大小.A4_横向(1)
    # for 角度 in range(3,91) :
    for 角度 in [3, 6, 10, 15, 30, 45, 90, 180]:
        神笔 = 矩形梦幻彩虹漩涡(作品文件路径=f"梦幻矩形\梦幻矩形_角度{角度}.svg", 宽=宽, 高=高)
        神笔.旋转角度 = 角度
        神笔.完成()
