# -*- coding:utf-8 -*-
# title           :
# description     :
# author          :Python超人/三月三提供
# date            :2024-08-13
# link            :https://gitee.com/march3
# python_version  :3.9
# ==============================================================================
from 神笔码靓.码靓库.头像.头像文件定义 import 头像部件配置
from 神笔码靓.码靓库.头像.头像模板生成器 import 头像模板生成器
from 神笔码靓.码靓库.头像.头像颜色定义 import 常见肤色, 常见发色
from 神笔码靓.神笔库 import 神笔绘图板
from 神笔码靓.神笔库.定义集 import *
from 神笔码靓.神笔库.配置 import *
from 神笔码靓.神笔库.通用工具集 import *
from 神笔码靓.码靓库.头像.头像元素 import 头像元素


class 头像绘图板(神笔绘图板):
    页面缩放调整 = 1.0759772  # 1.0759772 < 精确值 < 1.0759773

    def __init__(self, 头像文件路径, 宽, 高):
        self.页高 = 高
        super(头像绘图板, self).__init__(作品文件路径=头像文件路径, 宽=宽, 高=高)
        self.左边距, self.右边距 = 50, 50
        self.上边距, self.下边距 = 115, 60

    def 头像哥(self) -> 头像元素:
        部件配置 = 头像部件配置(性别="男")
        return 头像元素(self, 部件配置)

    def 头像妹(self) -> 头像元素:
        部件配置 = 头像部件配置(性别="女")
        return 头像元素(self, 部件配置)

    def 头像(self, 性别) -> 头像元素:
        部件配置 = 头像部件配置(性别=性别)
        return 头像元素(self, 部件配置)


if __name__ == '__main__':
    绘图板 = 头像绘图板("头像绘图板")
    绘图板.头像妹().面部("面部02").头发("头发02").耳朵("耳朵02").上身("上身13"). \
        头发颜色(常见发色.红色).肤色(常见肤色.黑色).毛发颜色(常见发色.黑色). \
        微调头发(左右=-0.01, 缩放=1.02).微调鼻子(上下=-0.05).创建模板().创造元素()
    绘图板.完成()
